[
  {
    "internshipId": "2720407",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Stammeringfreelife",
    "location": "Work from home",
    "duration": "3 Months",
    "stipend": "₹ 5,000 /month +  Incentives",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-business-development-sales-internship-at-stammeringfreelife1741007633",
    "description": "Selected intern's day-to-day responsibilities include: 1. Conduct market research to identify potential clients and uncover growth opportunities. 2. Assist in creating and implementing effective sales strategies to achieve target goals. 3. Build and maintain strong relationships with clients through regular communication and support. 4. Participate in sales meetings and presentations to showcase products and services. 5. Collaborate with the marketing team to develop promotional materials and engaging campaigns. 6. Track and analyze sales performance, providing regular reports and insights to management. 7. Learn and grow as a sales professional in a supportive, dynamic work environment.",
    "skills": [
      "Client Interaction",
      "Client Relationship",
      "Effective Communication",
      "English Proficiency (Spoken)",
      "MS-Excel",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "2 Apr' 25",
    "applyBy": "2 Apr' 25"
  },
  {
    "internshipId": "2720401",
    "jobTitle": "Catalog Specialist",
    "companyName": "ILoveSarees Private Limited",
    "location": "Chennai",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/product-design-internship-in-chennai-at-ilovesarees-private-limited1741245988",
    "description": "We are looking for a catalogue specialist for our brand, \"I Love Sarees,\" to enhance and manage catalogues on our website and various marketplaces such as Nykaa, Myntra, Ajio, etc Role Description Responsible for maintaining, updating, and adding products and associated data such as pricing, images, PDFs, and descriptions to our online store and various marketplaces. * Marketplace Management - Collaborating with vendors to ensure accurate product pricing. * Campaign Management - Crafting product campaigns including vouchers, discount promotions, and sales. * Inventory Control - Coordinating with the Warehouse team to update stock values based on client needs. Participating in the identification and correction of catalogue errors. Handle the day-to-day volumes of the assigned tasks and ensure that the quality standards are met; * Cultivated strong vendor partnerships to sustain and bolster business operations. Qualifications Recent computer science or Computer Application graduates - Interns &amp; Freshers can apply Advanced proficiency in Excel is a must qualification Strong organizational and project management skills, including prioritizing, scheduling, and time management. Exceptional interpersonal skills, ability to build relationships and influence others without authority. Good written and verbal communication skills, with an ability to communicate effectively at all levels of an organization. Please forward your resume to info@ilovesarees.com or Whatsapp 9043222190 Work Location: Guduvanchery, Chennai",
    "skills": [
      "Design Thinking",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "5 Apr' 25",
    "applyBy": "5 Apr' 25"
  },
  {
    "internshipId": "2730765",
    "jobTitle": "Inside Sales",
    "companyName": "Staycationer",
    "location": "Solapur",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/inside-sales-internship-in-solapur-at-malhar-jeurkar1742302723",
    "description": "Selected intern's day-to-day responsibilities include: 1. Maintain enquiry and sales ledger 2. Work on guest engagement for sales 3. Work on proactive mail communication with guests",
    "skills": [
      "Effective Communication",
      "English Proficiency (Spoken)",
      "Negotiation",
      "Problem Solving",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2726454",
    "jobTitle": "Video Editing/Making",
    "companyName": "Harvinder Singh Sabarwal",
    "location": "Navi Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month +  Incentives",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/video-editing-making-internship-in-navi-mumbai-at-harvinder-singh-sabarwal1741660974",
    "description": "Selected intern's day-to-day responsibilities include: 1. Video Editing: Perform basic to intermediate video editing including trimming, adding transitions, overlays, and applying color corrections using Adobe Premiere Pro, Filmora, or similar software. 2. Content Optimization: Ensure that all edited videos meet platform-specific requirements (e.g., YouTube, Instagram, LinkedIn) regarding format, size, and length. 3. File Management: Organize raw footage, project files, and edited videos systematically, ensuring quick access and backups. 4. Audio Sync and Adjustments: Sync video with audio, add background music, and adjust sound levels for clarity and balance.",
    "skills": [
      "Adobe Premiere Pro",
      "Video Editing",
      "Video Making",
      "Certificate",
      "Informal dress code",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "18 Apr' 25",
    "applyBy": "18 Apr' 25"
  },
  {
    "internshipId": "2694522",
    "jobTitle": "Travel & Tourism",
    "companyName": "TIME TOURS",
    "location": "Kolkata",
    "duration": "5 Months",
    "stipend": "₹ 5,000-7,500 /month",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/travel-tourism-internship-in-kolkata-at-time-tours1738156780",
    "description": "Selected intern's day-to-day responsibilities include: 1. Locating the best cost effective travel solutions 2. Researching travel content (new places/experiences) 3. Learning multiple facets of travel and tourism",
    "skills": [
      "Effective Communication",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "2 Apr' 25",
    "applyBy": "2 Apr' 25"
  },
  {
    "internshipId": "2737318",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Vinkey's DESSERTS",
    "location": "Ajmer",
    "duration": "1 Month",
    "stipend": "₹ 2,000 - 2,500 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-ajmer-at-vinkeys-desserts1742920731",
    "description": "Selected intern's day-to-day responsibilities include: 1. Generating leads 2. Making posts for social media 3. Handling sales and outreach",
    "skills": [
      "Client Relationship Management (CRM)",
      "Document Management",
      "Email Marketing",
      "English Proficiency (Written)",
      "Market research",
      "Sales",
      "Social Media Marketing",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2722582",
    "jobTitle": "Digital Marketing",
    "companyName": "Maxleben Advisory",
    "location": "Mohali",
    "duration": "6 Months",
    "stipend": "₹ 7,000 /month",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/digital-marketing-internship-in-multiple-locations-at-maxleben-advisory1741175714",
    "description": "Selected intern's day-to-day responsibilities include: 1. Working on company branding/promotions 2. Running Ads and Campaigns on social media 3. Generating leads from Facebook &amp; Instagram 4. Working on basic designing (creating images, and posts for SM) 5. Working on creating graphics for a social media account",
    "skills": [
      "Canva",
      "Digital Marketing",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Facebook Ads",
      "Facebook Marketing",
      "Google AdWords",
      "Instagram Marketing",
      "Lead Generation",
      "Marketing Campaigns",
      "Search Engine Marketing (SEM)",
      "Search Engine Optimization (SEO)",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "4 Apr' 25",
    "applyBy": "4 Apr' 25"
  },
  {
    "internshipId": "2715510",
    "jobTitle": "Field Sales",
    "companyName": "HOCC IMPEX",
    "location": "Chennai",
    "duration": "2 Months",
    "stipend": "₹ 2,000 /month +  Incentives",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/field-sales-internship-in-chennai-at-hocc-impex1740490257",
    "description": "HOCC Impex is a premium ceramic ware brand based in Chennai, India. We blend traditional craftsmanship with modern aesthetics to design and produce a range of exquisite ceramic products, from vases and pots to cups and unique pieces that add elegance and functionality to contemporary spaces. Our commitment to quality and authenticity is reflected in our sourcing of high-quality clay from various regions and collaboration with master craftsmen. Role Description This is a full-time on-site Sales and Marketing Intern role at HOCC Impex in Chennai. The Sales and Marketing Intern will be responsible for communication with customers, providing excellent customer service, assisting in sales activities, training, and supporting sales management. The role offers hands-on experience in the sales and marketing functions of a premium ceramic ware company. Key Responsibilities: 1. Identify and visit potential clients such as restaurants, cafes, event planners, corporate offices, and retailers 2. Present our ceramic handicrafts product line and explain pricing, quality, and bulk order benefits 3. Build relationships with clients and close sales deals 4. Gather customer feedback and report daily progress to the sales team Qualifications 1. Communication and Customer Service skills 2. Sales and Sales Management skills 3. Training skills 4. Strong interpersonal skills 5. Ability to work in a team environment 6. Interest in ceramics or artistry is a plus *Only candidates with proficiency in both Tamil and English will be given preference.",
    "skills": [
      "English Proficiency (Spoken)",
      "Tamil Proficiency (Spoken)",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "20 Apr' 25",
    "applyBy": "20 Apr' 25"
  },
  {
    "internshipId": "2724262",
    "jobTitle": "Operations",
    "companyName": "MADHURMANGOES PRIVATE LIMITED",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/operations-internship-in-pune-at-madhurmangoes-private-limited1741606183",
    "description": "Selected intern's day-to-day responsibilities include taking the orders online from our website and executing them end-to-end (it involves the core operations part). Process Coordination - Assisting in managing daily operations to ensure smooth workflow. Data Entry &amp; Documentation - Maintaining records, updating databases, and organizing important documents. Inventory &amp; Supply Management - Tracking stock levels, coordinating purchases, and ensuring availability of necessary materials. Logistics &amp; Scheduling - Assisting in planning deliveries, shipments, or service schedules. Communication &amp; Support - Coordinating with internal teams, vendors, or clients to ensure efficient operations.",
    "skills": [
      "English Proficiency (Spoken)",
      "Certificate",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "9 Apr' 25",
    "applyBy": "9 Apr' 25"
  },
  {
    "internshipId": "2737191",
    "jobTitle": "Motion Graphics",
    "companyName": "Integral Solution",
    "location": "Bangalore",
    "duration": "4 Months",
    "stipend": "₹ 18,000 - 20,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/motion-graphics-internship-in-bangalore-at-integral-solution1742881450",
    "description": "Are you a creative individual with a passion for design and animation? Integral Solution is looking for a talented Motion Graphics intern to join our dynamic team! As an intern, you will have the opportunity to work on exciting projects, gain valuable hands-on experience, and enhance your skills in motion graphics. 1. Assist in creating visually stunning animations and graphics for various projects 2. Collaborate with the design team to brainstorm and develop innovative ideas 3. Work on video editing and post-production tasks to enhance the overall visual appeal 4. Support in creating motion graphics for social media, marketing campaigns, and presentations 5. Assist in creating storyboard concepts and translating them into animations 6. Stay up-to-date with the latest trends in motion graphics and design techniques 7. Take on additional tasks and projects as needed to support the team If you are a motivated individual looking to kickstart your career in motion graphics, apply now and unleash your creativity with Integral Solution!",
    "skills": [
      "Adobe After Effects",
      "Adobe Animate",
      "Adobe Illustrator",
      "Adobe Photoshop",
      "Adobe Premiere Pro",
      "Animation",
      "Video Editing",
      "Video Making",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2738446",
    "jobTitle": "Digital Marketing",
    "companyName": "Happiness Plans",
    "location": "Indore",
    "duration": "3 Months",
    "stipend": "₹ 5,000 - 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/digital-marketing-internship-in-indore-at-happiness-plans1742982517",
    "description": "As a Digital Marketing intern at Happiness Plans, you will have the opportunity to put your skills in Social Media Marketing, SEO, Creative Writing, Email Marketing, Instagram Marketing, Facebook Marketing, SEM, and English proficiency to use in a dynamic and creative environment. 1. Assist in the development and implementation of digital marketing strategies to increase brand awareness and drive customer engagement. 2. Manage and create content for various social media platforms to engage with our target audience and promote our products and services. 3. Conduct keyword research and optimize website content to improve search engine rankings and drive organic traffic. 4. Assist in the creation and execution of email marketing campaigns to nurture leads and drive conversions. 5. Monitor and analyze the performance of digital marketing campaigns to identify areas for improvement and optimize results. 6. Collaborate with the marketing team to develop and execute Instagram and Facebook marketing campaigns to increase brand visibility and engagement. 7. Participate in brainstorming sessions and contribute creative ideas to enhance our overall digital marketing strategy. If you are a motivated and creative individual looking to gain hands-on experience in the digital marketing field, apply now to join our team at Happiness Plans!",
    "skills": [
      "Creative Writing",
      "Digital Marketing",
      "Email Marketing",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Facebook Marketing",
      "Instagram Marketing",
      "Search Engine Marketing (SEM)",
      "Search Engine Optimization (SEO)",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737660",
    "jobTitle": "Project Management",
    "companyName": "Indian Institute Of Gems And Jewellery",
    "location": "Mumbai",
    "duration": "2 Months",
    "stipend": "₹ 18,000 - 20,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/project-management-internship-in-mumbai-at-indian-institute-of-gems-and-jewellery1742982628",
    "description": "Role: Project Management (CEO's Office) - Andheri East. Selected intern's day-to-day responsibilities include: A. Project coordination: 1. Assist in coordinating and managing strategic projects from initiation to completion, about admin, operations, HR, social media, marketing, and any other projects as assigned by the CEO 2. Collaborate with project stakeholders to define project scope, objectives, deliverables, timelines, and successful completion B. Research and analysis: 1. Conduct research and analysis on industry trends, competitors, and emerging technologies 2. Help identify opportunities for business growth and innovation. Assist in preparing reports and presentations for the CEO's Office C. Communication and stakeholder management: 1. Support the CEO's office in effective communication with internal and external stakeholders 2. Assist in preparing and distributing executive-level communications, including announcements, memos, and presentations 3. Help manage relationships with key stakeholders and ensure their needs and expectations are addressed D. Process improvement: 1. Identify opportunities to streamline processes and improve operational efficiency within the CEO's office 2. Assist in documenting and updating standard operating procedures 3. Help implement tools and technologies to enhance productivity and collaboration. Note: The internship may be extended depending on your performance during the initial period of the interview.",
    "skills": [
      "Business Analysis",
      "Canva",
      "Data Analytics",
      "Digital Marketing",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Microsoft Project",
      "MS-Excel",
      "MS-Office",
      "Operations",
      "Project Management",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738204",
    "jobTitle": "Content Writing",
    "companyName": "The Honest Pet Co.",
    "location": "Work from home",
    "duration": "3 Months",
    "stipend": "₹ 10,000 - 20,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-content-writing-internship-at-the-honest-pet-co1742982969",
    "description": "Are you a passionate animal lover with a knack for storytelling? Join The Honest Pet Co. as a content writing intern and unleash your creativity! As a key member of our team, you will have the opportunity to showcase your skills in creative writing, social media marketing, digital marketing, blogging, and photography. Selected intern's day-to-day responsibilities include: 1. Develop engaging and informative content for our website, blog, and social media platforms. 2. Collaborate with the marketing team to create compelling campaigns that resonate with our target audience. 3. Assist in the planning and execution of social media strategies to increase brand awareness and engagement. 4. Conduct research on industry trends and competitor analysis to stay ahead of the curve. 5. Capture high-quality images of our products and pets for use in marketing materials. 6. Write product descriptions, newsletters, and other promotional materials that drive sales. 7. Contribute fresh ideas and creative solutions to enhance our brand presence in the market. If you are a driven individual with a passion for pets and a talent for words, we want to hear from you! Apply now and embark on a rewarding journey with The Honest Pet Co.",
    "skills": [
      "Blogging",
      "Creative Writing",
      "Digital Marketing",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Photography",
      "Social Media Marketing",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738209",
    "jobTitle": "Content Writing",
    "companyName": "Mosaic Wellness",
    "location": "Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writing-internship-in-mumbai-at-mosaic-wellness1742979030",
    "description": "We are looking for an intern with a strong literature, communications, or content-writing background to join our customer experience team. In this role, you will collaborate closely with our brand marketing and content team to enhance customer responses, ensuring every message embodies empathy, clarity, factual accuracy, and brand tonality. Your work will help create a customer experience that feels personal, thoughtful, and memorable where customers genuinely enjoy engaging with us. Selected intern's day-to-day responsibilities include: 1. Review and refine customer service responses (social and chat) to align with our brand tone of voice. 2. Collaborate with the brand marketing team to incorporate storytelling, empathy, and human touch into customer communication. 3. Help create response templates and knowledge base articles that are clear, engaging, and informative. 4. Ensure factual accuracy and clarity in all customer-facing content. 5. Monitor customer feedback and engagement to continuously improve communication strategies.",
    "skills": [
      "Creative Writing",
      "English Proficiency (Written)",
      "Certificate",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738281",
    "jobTitle": "Gujarati Transcription Quality Analyst",
    "companyName": "Indiaum Solutions",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "₹ 5,000 - 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-gujarati-transcription-quality-analyst-internship-at-indiaum-solutions1742981246",
    "description": "Selected intern's day-to-day responsibilities include: 1. Review and check transcriptions for accuracy and formatting errors. 2. Provide feedback to transcribers for improvement. 3. Maintain high transcription quality standards. 4. Work closely with team leads and project managers.",
    "skills": [
      "Gujarati Proficiency (Written)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738330",
    "jobTitle": "Lesson Plan Creation (English)",
    "companyName": "Graveiens Eduservices Private Limited",
    "location": "Work from home",
    "duration": "3 Months",
    "stipend": "₹ 6,000 - 12,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-lesson-plan-creation-english-internship-at-graveiens-eduservices-private-limited1742982305",
    "description": "Selected intern's day-to-day responsibilities include: 1. Utilize your expertise in the English language to create high-quality lesson plans that align with curriculum standards 2. Collaborate with the content development team to ensure the accuracy and relevance of educational materials 3. Research educational trends and best practices to enhance the quality of lesson plans 4. Incorporate innovative teaching strategies and interactive activities to make learning fun and engaging 5. Provide feedback and suggestions for improvement on existing lesson plans 6. Proofread and edit lesson plans to ensure clarity, coherence, and consistency If you are a creative thinker with a strong grasp of the English language and education, we want to hear from you! Join us in shaping the future of education through impactful lesson planning. Apply now and be a part of our dynamic team!",
    "skills": [
      "Content Writing",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Online Teaching",
      "Subject Matter Expert (SME)",
      "Teaching",
      "Certificate",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738288",
    "jobTitle": "Gujarati Linguistic QA Specialist",
    "companyName": "Indiaum Solutions",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "₹ 5,000 - 12,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-gujarati-linguistic-qa-specialist-internship-at-indiaum-solutions1742981333",
    "description": "Selected intern's day-to-day responsibilities include: 1. Review transcriptions for linguistic accuracy. 2. Identify inconsistencies and improve transcript quality. 3. Work on projects that require dialect understanding. 4. Ensure compliance with project-specific rules.",
    "skills": [
      "Gujarati Proficiency (Spoken)",
      "Gujarati Proficiency (Written)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738284",
    "jobTitle": "Gujarati Transcription Reviewer",
    "companyName": "Indiaum Solutions",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "₹ 5,000 - 15,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-gujarati-transcription-reviewer-internship-at-indiaum-solutions1742981297",
    "description": "Selected intern's day-to-day responsibilities include: 1. Verify and correct errors in Gujarati transcriptions. 2. Ensure transcriptions match the original audio accurately. 3. Provide structured feedback to transcribers. 4. Track performance and maintain quality benchmarks.",
    "skills": [
      "Gujarati Proficiency (Spoken)",
      "Gujarati Proficiency (Written)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738321",
    "jobTitle": "Project Management",
    "companyName": "ADORE",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "₹ 2,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-project-management-internship-at-adore1742981629",
    "description": "Selected intern's day-to-day responsibilities include: 1. Work and implement various programs and assignments to help the management. 3. Coordinate meetings and communications between different teams and projects. 4. Plan, prepare, and deliver presentations on behalf of the team. 5. Monitor and organize the growth of teams and activities. 6. Work on marketing, promotion, concept development, and planning. 7. Develop centers, networks, and speakers (approach schools, colleges, and colleagues/friends) 8. Handle any other responsibilities for the growth of the organization. Perks: 1. Gain experience. 2. Skill development. 3. Receive guidance and mentorship. 4. Networking opportunities (National as well as international). 5. Portfolio enhancement. 6. Industry insights. 7. Exposure to software and tools. 8. Team collaboration. 9. Learning opportunities: Attend training sessions. 10. Flexibility. 11. E-certificate. Note: 1. Apply only if you give a minimum of 4 hours daily in two slots (any time between 10 AM and 10 PM). 2. A minimum of 6 hrs per day on Zoom is required. Laptop compulsory. 3. Duration: For 6 months minimum.",
    "skills": [
      "English Proficiency (Spoken)",
      "MS-Office",
      "Certificate",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738292",
    "jobTitle": "Senior Gujarati Transcription QA Expert",
    "companyName": "Indiaum Solutions",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "₹ 5,000 - 12,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-senior-gujarati-transcription-qa-expert-internship-at-indiaum-solutions1742981368",
    "description": "Selected intern's day-to-day responsibilities include: 1. Oversee and validate Gujarati transcriptions. 2. Implement quality control measures. 3. Train and mentor junior transcribers. 4. Develop guidelines for maintaining quality standards.",
    "skills": [
      "Gujarati Proficiency (Spoken)",
      "Gujarati Proficiency (Written)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738351",
    "jobTitle": "Content Writer (SEO)",
    "companyName": "Tring",
    "location": "Thane, Navi Mumbai, Mumbai, Panvel",
    "duration": "3 Months",
    "stipend": "₹ 11,000 - 25,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writer-seo-internship-in-multiple-locations-at-tring1742978381",
    "description": "Are you a talented content writer with a passion for SEO? Join our team at Tring as an SEO Content Writer intern and take your digital marketing skills to the next level! As part of our dynamic team, you will have the opportunity to create engaging and SEO-optimized content for our website and social media platforms. With your expertise in copywriting, English proficiency, and knowledge of HTML/CSS, WordPress, and blogging, you will play a crucial role in driving traffic and increasing our online presence. Selected intern's day-to-day responsibilities include: 1. Develop high-quality, SEO-friendly content (both long-form and short-form) for organic search growth. 2. Conduct keyword research using industry tools to optimize content for search engines. 3. Write and edit engaging articles with effective use of keywords, titles, and descriptions to improve search visibility. 4. Ensure content is error-free and aligns with SEO best practices. 5. Format content with HTML/CSS as needed and publish on the website. 6. Stay updated on SEO trends and refine content strategies accordingly.",
    "skills": [
      "Copywriting",
      "CSS",
      "Digital Marketing",
      "English Proficiency (Written)",
      "Search Engine Optimization (SEO)",
      "WordPress",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738246",
    "jobTitle": "Search Engine Optimization (SEO)",
    "companyName": "Gurucool",
    "location": "Jaipur",
    "duration": "6 Months",
    "stipend": "₹ 5,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/search-engine-optimization-seo-internship-in-jaipur-at-gurucool1742974211",
    "description": "Are you a tech-savvy individual with a passion for digital marketing and a knack for optimizing online content? Gurucool is seeking a dynamic SEO intern to join our team and help drive our online visibility to new heights! As a Gurucool SEO intern, you will have the opportunity to work alongside experienced professionals in the field, gaining hands-on experience and valuable insights into the world of digital marketing. Key responsibilities: 1. Conduct keyword research and analysis to identify trends and opportunities for optimization. 2. Optimize website content for search engines using best practices in SEO. 3. Assist in the development and implementation of SEO strategies to improve organic search rankings. 4. Monitor and report on website performance metrics using tools such as Google Analytics. 5. Assist in the management of Google AdWords campaigns to drive targeted traffic to our site. 6. Collaborate with the social media team to integrate SEO best practices into social media marketing campaigns. 7. Stay up-to-date on the latest trends and developments in SEO and digital marketing to ensure Gurucool remains at the forefront of online visibility. If you are a motivated self-starter with a keen eye for detail and a passion for all things digital, we want to hear from you! Join Gurucool today and take your SEO skills to the next level! You will be provided with the office system for work.",
    "skills": [
      "Digital Marketing",
      "Google AdWords",
      "Search Engine Marketing (SEM)",
      "Search Engine Optimization (SEO)",
      "Social Media Marketing",
      "Certificate",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738276",
    "jobTitle": "Gujarati Language Transcription",
    "companyName": "Indiaum Solutions",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "₹ 5,000 - 15,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-gujarati-language-transcription-internship-at-indiaum-solutions1742981099",
    "description": "Selected intern's day-to-day responsibilities include: 1. Convert spoken Gujarati audio into text. 2. Maintain accuracy and consistency in transcription. 3. Edit and proofread transcriptions before submission. 4. Closely with the QA team for feedback and improvements.",
    "skills": [
      "Gujarati Proficiency (Spoken)",
      "Gujarati Proficiency (Written)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738272",
    "jobTitle": "Gujarati Transcription",
    "companyName": "Indiaum Solutions",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "₹ 3,000 - 7,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-gujarati-transcription-internship-at-indiaum-solutions1742980991",
    "description": "Selected intern's day-to-day responsibilities include: 1. Listen to Gujarati audio files and transcribe them with accuracy. 2. Follow project-specific guidelines and formatting rules. 3. Deliver transcriptions within the given deadline. 4. Ensure correct spelling and grammar in Gujarati.",
    "skills": [
      "Gujarati Proficiency (Spoken)",
      "Gujarati Proficiency (Written)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738280",
    "jobTitle": "Gujarati Transcription",
    "companyName": "Indiaum Solutions",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "₹ 5,000 - 15,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-gujarati-transcription-internship-at-indiaum-solutions1742981172",
    "description": "Selected intern's day-to-day responsibilities include: 1. Work on a variety of Gujarati audio files. 2. Maintain high levels of accuracy and adhere to project guidelines. 3. Revise and correct transcripts based on feedback. 4. Meet daily/weekly targets for transcription tasks.",
    "skills": [
      "Gujarati Proficiency (Written)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738264",
    "jobTitle": "Interior Design",
    "companyName": "Komal Dayal",
    "location": "Ahmedabad",
    "duration": "6 Months",
    "stipend": "₹ 6,000 - 12,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-interior-design-internship-in-ahmedabad-at-komal-dayal1742980492",
    "description": "Selected intern's day-to-day responsibilities include: 1. Researching on materails,calling vendors 2. Creating BOQ's 3. Making 3d renders",
    "skills": [
      "Adobe Photoshop",
      "AutoCAD",
      "Google SketchUp",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738373",
    "jobTitle": "Fundraising",
    "companyName": "Hamari Pahchan NGO",
    "location": "Delhi, South",
    "duration": "3 Months",
    "stipend": "₹ 3,000 - 7,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/fundraising-internship-in-multiple-locations-at-hamari-pahchan-ngo1742979586",
    "description": "Selected intern's day-to-day responsibilities include: 1. Deal with virtual fundraising activities and assist the team in day-to-day activities 2. Draft initial correspondence with potential donors and supporters and follow up the contact 3. Draft funding applications and performance reports 4. Thank and update supporters 5. Assist with planning fundraising events and drafting funding materials 6. Monitor donor websites and identify and inform donor opportunities matching the work of the organization 7. Undertake online research and build contacts with potential individual donors and raise funds for the activities of the organization 8. Maintain up to date filing systems, both manual and electronic as appropriate 9. Make strategies and follow the same 10. Run different social media campaigns on social media as per the projects 11. Handle donor management 12. Work on increasing and involving more and more members and volunteers to raise funds",
    "skills": [
      "Effective Communication",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Office",
      "Research and Analytics",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738199",
    "jobTitle": "Chartered Accountancy (CA)",
    "companyName": "HM Thacker And Associates LLP",
    "location": "Thane, Mumbai",
    "duration": "12 Months",
    "stipend": "₹ 7,000 - 9,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/chartered-accountancy-ca-internship-in-multiple-locations-at-hm-thacker-and-associates-llp1742972621",
    "description": "Selected intern's day-to-day responsibilities include: 1. Filing GST returns 2. Filing Income Tax Returns 3. Work on Auditing",
    "skills": [
      "Accounting",
      "Auditing",
      "Company Law",
      "Financial Analysis",
      "Financial literacy",
      "Financial Reporting",
      "GST",
      "Income Tax",
      "MS-Excel",
      "MS-Office",
      "MS-Word",
      "Tally",
      "Taxation",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738187",
    "jobTitle": "Creative Design",
    "companyName": "Atrios Consulting",
    "location": "Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 8,000 - 12,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/creative-design-internship-in-mumbai-at-atrios-consulting1742975633",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in creating academic content for children in a visually engaging format 2. Design visually appealing educational materials using Canva 3. Collaborate with the team to storyboard and plan video scripts 4. Ensure the accuracy and age-appropriateness of content 5. Conduct basic research on curriculum topics to support content development",
    "skills": [
      "Canva",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738297",
    "jobTitle": "Human Resources (HR)",
    "companyName": "CloudBird Digital Private Limited",
    "location": "Noida",
    "duration": "3 Months",
    "stipend": "₹ 7,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/human-resources-hr-internship-in-noida-at-cloudbird-digital-private-limited1742975849",
    "description": "Selected intern's day-to-day responsibilities include: 1. Identifying and sourcing the best talent as per requirements and related company standards 2. Designing job descriptions and interview questions that will reflect each requirement 3. Working on preparation and posting of job descriptions, sourcing, technical screening, negotiation, and closing candidates for assigned requisitions 4. Ensuring positive candidate interview experience 5. Working on documentation and post-hiring formalities of the selected candidates 6. Handling staff inquiries regarding HR policies, employee benefits, and other HR-related matters Note: This internship requires working from the office.",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "MS-Office",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738239",
    "jobTitle": "Business Strategy",
    "companyName": "GoMechanic",
    "location": "Gurgaon",
    "duration": "3 Months",
    "stipend": "₹ 12,000 - 15,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-strategy-internship-in-gurgaon-at-gomechanic1742979617",
    "description": "Selected intern's day-to-day responsibilities include: 1. Support founders: Assist with scheduling, travel, and daily administrative tasks. 2. Strategic projects: Help research and manage key business projects and initiatives. 3. Cross-functional collaboration: Work with different teams (Tech, Product, etc.) to align goals. 4. Event coordination: Organize internal meetings, town halls, and events.",
    "skills": [
      "English Proficiency (Spoken)",
      "MS-Excel",
      "Certificate",
      "Informal dress code",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738253",
    "jobTitle": "Cinematography",
    "companyName": "Small Box Office",
    "location": "Delhi",
    "duration": "6 Months",
    "stipend": "₹ 7,500 - 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-cinematography-internship-in-delhi-at-small-box-office1742974255",
    "description": "Selected intern's day-to-day responsibilities include: 1. Collaborate with the director to interpret the script and develop a visual style. 2. Decide on camera angles, movements, and framing techniques. 3. Choose cameras, lenses, lighting equipment, and other gear suited for the production.",
    "skills": [
      "Adobe After Effects",
      "Adobe Photoshop",
      "Adobe Premiere Pro",
      "Photography",
      "Video Editing",
      "Video Making",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737949",
    "jobTitle": "Animation",
    "companyName": "Ritwik Ghosh",
    "location": "Kolkata, West Bengal",
    "duration": "5 Months",
    "stipend": "₹ 5,000 - 7,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/animation-internship-in-multiple-locations-at-ritwik-ghosh1742971219",
    "description": "Selected intern's day-to-day responsibilities include: 1. Storyboarding for animation projects. 2. Creating 6 to 10-minute animations. 3. Editing animations for clarity and consistency. 4. Managing backups of project files. 5. 8 hours of work.",
    "skills": [
      "2D Animation",
      "3D Animation",
      "Adobe After Effects",
      "Adobe Animate",
      "Adobe Illustrator",
      "Adobe Photoshop",
      "Adobe Premiere Pro",
      "Animation",
      "Autodesk 3ds Max",
      "Autodesk Maya",
      "Bengali Proficiency (Written)",
      "Blender 3D",
      "Storyboarding",
      "Video Editing",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738244",
    "jobTitle": "Investment Analyst",
    "companyName": "Bhaarat Wealth Group",
    "location": "Gurgaon, Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 50,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/investment-analyst-internship-in-multiple-locations-at-bhaarat-wealth-group1742980008",
    "description": "Investment Analyst Intern - Real Estate &amp; Investment Industry. Location: Gurgaon &amp; Mumbai. Bhaarat Wealth Group is a leading real estate investment firm specializing in high-return land investments. We help investors achieve 2.5X returns in 18-24 months through strategic land acquisitions. We are looking for an Investment Analyst Intern to assist in financial analysis, market research, and investment strategy development. This role offers hands-on exposure to real estate investment deals, financial modeling, and risk assessment. Selected intern's day-to-day responsibilities include: 1. Analyze real estate investment opportunities and financial models. 2. Conduct market research on pricing trends, demand-supply dynamics, and competitive landscapes. 3. Assist in preparing investment proposals, investor presentations, and financial reports. 4. Evaluate risk factors, ROI calculations, and asset performance. 5. Work closely with senior analysts to support strategic investment decisions. What we offer: 1. 50,000 monthly stipend. 2. Certificate of completion and letter of recommendation. 3. Hands-on experience in a high-growth real estate investment firm. 4. Direct exposure to high-value investment deals and industry leaders. 5. Opportunity for a full-time role based on performance. If you're passionate about finance, investments, and real estate, apply now to kickstart your career with Bhaarat Wealth Group.",
    "skills": [
      "Effective Communication",
      "Financial Analysis",
      "Financial literacy",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738058",
    "jobTitle": "Digital Marketing Associate",
    "companyName": "Skills Beyond Education",
    "location": "Bangalore",
    "duration": "5 Months",
    "stipend": "₹ 7,500 - 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/digital-marketing-associate-internship-in-bangalore-at-skills-beyond-education1742971815",
    "description": "At Skills Beyond Education, we are looking for a passionate and committed digital marketing intern to join us. Selected intern's day-to-day responsibilities include: 1. Creating and implementing the digital marketing plan &amp; strategies 2. Learn various tech tools &amp; automation and implement quickly 3. Manage our leads database and retarget marketing 4. Create &amp; implement email marketing strategies 5. Create &amp; implement WhatsApp marketing strategies 6. Manage SEO optimization for websites 7. Set up &amp; manage Meta Ads &amp; Google Ads 8. Carry out marketing &amp; content research for ads &amp; social media posts 9. Coordinate with social media team to increase followers, branding &amp; visibility 10. Prepare weekly reports &amp; upcoming week work plan 11. Perform duties and responsibilities concurrent with the designated role 12. Report directly to CEO &amp; get mentored",
    "skills": [
      "Canva",
      "Content Marketing",
      "Digital Marketing",
      "Email Marketing",
      "Facebook Marketing",
      "Google AdWords",
      "Google Analytics",
      "MS-Office",
      "Search Engine Optimization (SEO)",
      "Social Media Marketing",
      "Wix",
      "Certificate",
      "Letter of recommendation",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738053",
    "jobTitle": "Dietetics/Nutrition",
    "companyName": "Nikita Vakil",
    "location": "Mumbai",
    "duration": "4 Months",
    "stipend": "₹ 4,000 - 5,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-dietetics-nutrition-internship-in-mumbai-at-nikita-vakil1742968820",
    "description": "Selected intern's day-to-day responsibilities include: 1. Create personalized diet plans based on client goals. 2. Input client data and maintain accurate records. 3. Perform nutrition calculations (calories, macronutrients, etc.). 4. Manage social media content ( optional) Details: 1. Address: Tatvam Clinic, shop No 1, ground floor, Perena CHS, opp Ratanshee Kheraj Sarees, near Gita building, close to Grant Road Station. 2. Timings: 10:30 AM to 2:30 PM, Monday to Saturday.",
    "skills": [
      "Dietetics/Nutrition",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2736134",
    "jobTitle": "Full Stack Development",
    "companyName": "Crazyjump Pvt Ltd",
    "location": "Ghaziabad",
    "duration": "3 Months",
    "stipend": "₹ 2,000 - 3,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/full-stack-development-internship-in-ghaziabad-at-crazyjump-pvt-ltd1742878913",
    "description": "Selected intern's day-to-day responsibilities include: 1. Develop responsive and dynamic user interfaces using React Native. 2. Implement UI components with React Hooks, Redux, and Context API. 3. Ensure cross-browser compatibility and mobile responsiveness. 4. Optimize applications for speed and scalability. 5. Develop cross-platform mobile applications for iOS and Android using React Native. 6. Implement UI components with React Hooks, Redux, and Context API. 7. Ensure high performance and smooth animations using best practices. 8. Optimize applications for various screen sizes and OS versions. 9. Integrate third-party libraries and APIs (e.g., Firebase, payment gateways, Logistics). 10. Design, develop, and maintain RESTful APIs using Node.js and Express.js. 11. Implement authentication and authorization mechanisms (JWT, OAuth). 12. Manage and optimize relational databases using MySQL. 13. Write efficient SQL queries and ensure database security. 14. Implement caching, logging, and monitoring solutions for performance optimization. 15. Collaborate with managers, and other developers to deliver high-quality software. 16. Conduct code reviews, write clean and maintainable code, and follow best practices. 17. Troubleshoot, debug, and enhance existing applications. 18. Stay updated with the latest technologies and industry trends.",
    "skills": [
      "CSS",
      "HTML",
      "JavaScript",
      "MySQL",
      "Node.js",
      "React",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2738227",
    "jobTitle": "Talent Acquisition",
    "companyName": "P&M",
    "location": "Gurgaon, Delhi",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/talent-acquisition-internship-in-multiple-locations-at-p-m1742979157",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in the creation of job postings and sourcing candidates through various channels 2. Manage the social media pages of the company on Instagram, Facebook and LinkedIn 3. Screening resumes and conducting initial phone interviews with potential candidates 4. Coordinating interviews and communicating with candidates throughout the recruitment process 5. Supporting the onboarding process for new hires and assisting with orientation sessions 6. Updating and maintaining the applicant tracking system with accurate candidate information 7. Participating in recruitment events and career fairs to promote our employer brand",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738252",
    "jobTitle": "Content Writing",
    "companyName": "Legal Bites",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "₹ 4,000 - 5,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-content-writing-internship-at-legal-bites1742980453",
    "description": "Legal Bites is seeking a passionate content writing intern with strong legal research and writing skills. This role offers hands-on experience in creating high-quality legal content, including articles, blogs, and case studies. Selected intern's day-to-day responsibilities include: 1. Conducting legal research. 2. Writing and editing content. 3. Generating new ideas. 4. Staying updated on legal trends. 5. Contributing to social media. Join us to sharpen your skills and build a strong legal writing portfolio. Apply now!",
    "skills": [
      "English Proficiency (Written)",
      "Legal Research",
      "Legal Writing",
      "Certificate",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738137",
    "jobTitle": "Commercial Photography",
    "companyName": "Visible Gain",
    "location": "Noida",
    "duration": "6 Months",
    "stipend": "₹ 10,000 - 12,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/commercial-photography-internship-in-noida-at-visible-gain1742973086",
    "description": "Selected intern's day-to-day responsibilities include: 1. Capture high-quality images of products for e-commerce websites, social media, and marketing materials. 2. Set up proper lighting, angles, and compositions to highlight product features. 3. Edit and retouch images to ensure consistency and brand alignment. 4. Maintain and organize an efficient workflow for shooting, editing, and uploading images. 5. Collaborate with the marketing and design team to develop creative visual content. 6. Manage and maintain photography equipment, ensuring optimal performance. 7. Ensure images meet platform-specific requirements (e.g., Amazon, Shopify, eBay). 8. Conduct occasional lifestyle or model shoots to enhance product presentation.",
    "skills": [
      "Marketing",
      "Photography",
      "Videography"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738068",
    "jobTitle": "Human Resources (HR)",
    "companyName": "TheCoinRepublic",
    "location": "Bhopal",
    "duration": "6 Months",
    "stipend": "₹ 10,000 - 12,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/human-resources-hr-internship-in-bhopal-at-thecoinrepublic1742966532",
    "description": "Job Posting: Create and post job ads to attract candidates. Screening: Review resumes and conduct initial interviews to identify qualified candidates. Cold Calling: Reach out to potential candidates who haven't applied. Headhunting: Identify and engage top industry talent for specialized roles. Interview Coordination: Schedule and organize interviews between candidates and hiring managers. Reference Checks: Verify candidates' credentials and work history through reference checks. Offer Management: Prepare and extend job offers, and negotiate salary and benefits. Talent Pipeline Development: Maintain a pool of potential candidates for future job openings. NOTE:- Apply Only Bhopal Location Candidates.",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "MS-Office",
      "MS-Word",
      "Certificate",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737111",
    "jobTitle": "Law/Legal",
    "companyName": "YB Legal",
    "location": "Delhi",
    "duration": "1 Month",
    "stipend": "Unpaid",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/law-legal-internship-in-delhi-at-yb-legal1742895518",
    "description": "Selected intern's day-to-day responsibilities include: 1. Conduct legal research and assist in drafting legal documents 2. Support attorneys in preparing for trials, hearings, and other legal proceedings 3. Drafting suits, pleadings, complaints, notices and applications etc 4. Attend client meetings and court hearings, if required 5. Research, write and post on social media and other platforms 6. Assist in organizing and updating legal databases and documentation 7. Collaborate with the legal team on various projects and contribute to brainstorming sessions",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Certificate",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738206",
    "jobTitle": "Instagram Ad Writing",
    "companyName": "Ayurveda House Private Limited",
    "location": "Delhi",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/instagram-ad-writing-internship-in-delhi-at-ayurveda-house-private-limited1742978901",
    "description": "Selected intern's day-to-day responsibilities include: 1. Craft compelling, conversion-focused ad copies for Instagram ads, including carousels, reels, and static posts 2. Develop scroll-stopping hooks and persuasive storytelling to maximize engagement and click-through rates 3. Experiment with different ad variations (headlines, CTAs, formats) to optimize performance 4. Leverage trending phrases, pop culture references, and viral formats to enhance relatability 5. Tailor ad copy for specific customer segments, considering pain points and desires 6. Maintain a distinct, brand-aligned tone across all paid campaigns 7. Work with designers, media buyers, and performance marketers to create high-impact ad creatives",
    "skills": [
      "Content Writing",
      "Copywriting",
      "English Proficiency (Written)",
      "Certificate",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738034",
    "jobTitle": "Social Media Marketing",
    "companyName": "Gurucool",
    "location": "Jaipur",
    "duration": "6 Months",
    "stipend": "₹ 5,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/social-media-marketing-internship-in-jaipur-at-gurucool1742963381",
    "description": "Are you passionate about social media marketing and ready to dive into the world of digital marketing? Gurucool is seeking a talented Social Media Marketing intern to join our dynamic team. As an intern, you will have the opportunity to work on exciting projects and gain hands-on experience in a fast-paced environment. Key responsibilities: 1. Assist in creating and implementing social media marketing strategies to increase brand awareness and engagement. 2. Develop engaging content for various social media platforms including Facebook, Instagram, Twitter, and LinkedIn. 3. Monitor social media channels for trending topics and opportunities for engagement. 4. Analyze social media metrics and provide insights to improve overall performance. 5. Collaborate with the marketing team to create integrated campaigns across multiple channels. 6. Stay up-to-date with the latest social media trends and best practices. 7. Participate in brainstorming sessions and contribute creative ideas to enhance our social media presence. If you are a creative and enthusiastic individual with a strong understanding of social media marketing, we want to hear from you! Join us at Gurucool and take your digital marketing skills to the next level. Apply now and be part of our exciting journey.",
    "skills": [
      "Creative Writing",
      "Digital Marketing",
      "Email Marketing",
      "Facebook Marketing",
      "Search Engine Optimization (SEO)",
      "Social Media Marketing",
      "Certificate",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738230",
    "jobTitle": "Content Writing",
    "companyName": "Bhaarat Wealth Group",
    "location": "Gurgaon, Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 30,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writing-internship-in-multiple-locations-at-bhaarat-wealth-group1742979364",
    "description": "Bhaarat Wealth Group is a leading real estate investment firm specializing in high-return land investments. We help investors achieve 2.5X returns in 18-24 months through strategic land acquisitions. We are looking for a content writing intern to create high-quality blogs, LinkedIn posts, and website content that informs and engages investors. Selected intern's day-to-day responsibilities include: 1. Write well-researched blogs, articles, and social media content. 2. Research industry trends and market insights. 3. Assist in LinkedIn and Instagram content strategy. 4. Optimize content for SEO and engagement. 5. Collaborate with the marketing team on content planning. What we offer: 1. 30,000 monthly stipend. 2. Certificate of completion and letter of recommendation. 3. Hands-on experience in a high-growth industry. 4. Opportunity for a full-time role based on performance. 5. Location: Gurgaon &amp; Mumbai. If you're passionate about writing and eager to learn, apply now to join Bhaarat Wealth Group.",
    "skills": [
      "Content Editing",
      "Content Writing",
      "Creative Writing",
      "Effective Communication",
      "English Proficiency (Written)",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738061",
    "jobTitle": "Admin Executive",
    "companyName": "Nikita Vakil",
    "location": "Mumbai",
    "duration": "4 Months",
    "stipend": "₹ 3,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-admin-executive-internship-in-mumbai-at-nikita-vakil1742969553",
    "description": "Selected intern's day-to-day responsibilities include: 1. Schedule appointments and maintain an organized calendar. 2. Perform accurate data entry and update records as needed. 3. Manage and update social media platforms with relevant content. 4. Coordinate with clients and staff for scheduling and follow-ups. Details: 1. Address: Tatvam Clinic, shop No 1, ground floor, Perena CHS, opp Ratanshee Kheraj Sarees, near Gita building, close to Grant Road Station. 2. Timing 10:30-1 pm Monday to Saturday, Thursday 5-7.",
    "skills": [
      "Administrative Support",
      "Effective Communication",
      "Time Management"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738304",
    "jobTitle": "Marketing",
    "companyName": "Boomerang",
    "location": "Jaipur",
    "duration": "3 Months",
    "stipend": "₹ 10,000 - 10,001 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/marketing-internship-in-jaipur-at-boomerang1742976180",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in planning and executing marketing campaigns across various channels (social media, email, etc.) 2. Conduct market research to identify trends and opportunities 3. Support content creation, including writing blog posts, social media updates, and promotional materials 4. Help analyze campaign performance and prepare reports 5. Collaborate with team members to brainstorm innovative ideas",
    "skills": [
      "Digital Marketing",
      "Email Marketing",
      "English Proficiency (Spoken)",
      "Certificate",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737794",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Infigon Futures",
    "location": "Mumbai",
    "duration": "4 Months",
    "stipend": "₹ 24,500 - 50,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-mumbai-at-infigon-futures1742966334",
    "description": "Are you a motivated individual with a passion for sales and business development? Look no further! Infigon Futures is seeking a dynamic Business Development (Sales) intern to join our team. If you have experience in, and possess excellent spoken and written English skills, we want to hear from you. As a key member of our team, you will have the opportunity to showcase your marketing skills, effective communication, and drive for success. Join us in a fast-paced and exciting environment where you will be able to learn and grow professionally. Selected intern's day-to-day responsibilities include: 1. Connect with prospective clients on call and drive enrollments 2. Assist in developing and implementing sales strategies to drive revenue growth. 3. Create and manage email marketing campaigns to engage with prospects. 4. Utilize MS-Excel to analyze data and track sales performance. 5. Collaborate with the marketing team to create compelling messaging and materials. 6. Build and maintain relationships with clients to ensure satisfaction and retention. NOTE: In this internship, you will receive a base salary along with performance-based incentives.",
    "skills": [
      "Effective Communication",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Marketing",
      "MS-Excel",
      "Sales Strategy",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737019",
    "jobTitle": "Business Development Associate",
    "companyName": "RevenUmf",
    "location": "Surat",
    "duration": "3 Months",
    "stipend": "₹ 8,000 - 23,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-associate-internship-in-surat-at-revenumf1742922158",
    "description": "Selected intern's day-to-day responsibilities include: 1. Develop and maintain relationships with potential and existing clients. 2. Promote and sell mutual fund and insurance products to clients. 3. Identify market trends and opportunities for business growth. 4. Assist in the preparation of sales presentations and proposals. 5. Conduct market research to identify prospects and target customers. 6. Meet and exceed sales targets set by the management. 7. Provide clients with advice on suitable financial products based on their needs. 8. Coordinate with the marketing team to plan and execute promotional activities. 9. Follow up with clients to ensure satisfaction and encourage repeat business. 10. Keep abreast of industry trends and product updates. 11. Prepare reports on sales activities and performance.",
    "skills": [
      "Business Development",
      "Sales",
      "Certificate",
      "Letter of recommendation",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737841",
    "jobTitle": "Sales Associate",
    "companyName": "Silgate Solutions Limited",
    "location": "Thane, Navi Mumbai, Mumbai, Maharashtra",
    "duration": "3 Months",
    "stipend": "₹ 10,000 - 16,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-sales-associate-internship-in-multiple-locations-at-silgate-solutions-limited1742969404",
    "description": "Are you ready to kickstart your career in sales and join a dynamic team at Silgate Solutions Limited? As a sales consultant intern, you will have the opportunity to learn and grow in a fast-paced environment while gaining valuable hands-on experience. Selected intern's day-to-day responsibilities include: 1. Conduct market research to identify potential customers and opportunities for growth. 2. Assist in developing sales strategies and tactics to reach target markets. 3. Engage with clients through phone calls, emails, and meetings to promote products and services. 4. Prepare sales presentations and proposals to pitch to potential clients. 5. Collaborate with the sales team to achieve sales targets and objectives. 6. Track and analyze sales data to evaluate performance and identify areas for improvement. 7. Provide excellent customer service to build and maintain strong relationships with clients. If you are a motivated and goal-oriented individual with a passion for sales, then this internship opportunity is perfect for you. Join us at Silgate Solutions Limited and take the first step towards a successful career in sales! Apply now and unlock your potential.",
    "skills": [
      "Business Development",
      "Business Management",
      "Business Research",
      "Client Relationship",
      "Client Relationship Management (CRM)",
      "Effective Communication",
      "Interpersonal skills",
      "Market Analysis",
      "Market research",
      "Negotiation",
      "Sales",
      "Sales Management",
      "Sales Strategy",
      "Sales Support",
      "Strategy"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737774",
    "jobTitle": "Data Science",
    "companyName": "Brandbuddiez Technologies Private Limited",
    "location": "Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 25,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/data-science-internship-in-mumbai-at-brandbuddiez-technologies-private-limited1742965488",
    "description": "We are seeking a highly motivated and analytical data science intern to join our team. As a data science intern, you will have the opportunity to work alongside experienced data scientists and contribute to impactful data-driven projects. You will assist in gathering, cleaning, analyzing, and interpreting large datasets to drive business insights and decision-making processes. Selected intern's day-to-day responsibilities include: 1. Assist in collecting, cleaning, and preprocessing structured and unstructured data from various sources. 2. Conduct exploratory data analysis (EDA) to uncover trends, patterns, and relationships in data. 3. Develop statistical models and machine learning algorithms to solve real-world business problems. 4. Support the implementation and validation of predictive models and improve their accuracy. 5. Generate insights through data visualization using tools such as Matplotlib, Seaborn, Power BI, or Tableau. 6. Assist in preparing reports and presentations to communicate findings to both technical and non-technical stakeholders. 7. Collaborate with cross-functional teams, including engineering, product, and business, to ensure data science solutions align with business goals. 8. Stay up to date with the latest trends, tools, and techniques in data science and machine learning. What you will gain: 1. Hands-on experience with real-world data science projects. 2. Exposure to advanced machine learning techniques and industry-standard tools. 3. Mentorship and learning opportunities from experienced data scientists. 4. A collaborative and innovative work environment. 5. Potential for future employment based on performance.",
    "skills": [
      "Artificial intelligence",
      "Data Analytics",
      "Data Science",
      "Deep Learning",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Python",
      "SQL",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737528",
    "jobTitle": "AI/ML Marketing Specialist",
    "companyName": "Talent Corner HR Services",
    "location": "Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 10,000 - 15,000 lump sum",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/ai-ml-marketing-specialist-internship-in-mumbai-at-talent-corner-hr-services1742967236",
    "description": "Selected intern's day-to-day responsibilities include: As an AI/ML Marketing Specialist intern at Talent Corner HR Services, you will have the opportunity to work with cutting-edge technology and data analysis to drive marketing strategies and campaigns. Your role will be crucial in understanding market trends and consumer behavior to optimize our marketing efforts. Selected intern's day-to-day responsibilities include: 1. Utilize AI and ML techniques to analyze data and extract insights for targeted marketing campaigns. 2. Conduct market analysis to identify opportunities for growth and develop strategies to capitalize on them. 3. Collaborate with cross-functional teams to implement AI-driven solutions and drive marketing initiatives. 4. Monitor and evaluate marketing performance metrics to continuously improve strategies and tactics. 5. Stay current on AI and ML trends in marketing to provide innovative solutions and recommendations. 6. Assist in creating compelling content and visuals that resonate with target audiences. 7. Contribute to the overall success of the marketing team by actively participating in brainstorming sessions and strategy meetings.",
    "skills": [
      "Artificial intelligence",
      "Data Analysis",
      "Machine Learning",
      "Machine Learning Operations (MLOps)",
      "Market Analysis",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737897",
    "jobTitle": "Artificial Neural Networks",
    "companyName": "Coding Junior",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "Unpaid",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-artificial-neural-networks-internship-at-coding-junior1742967483",
    "description": "Are you a tech-savvy individual with a passion for artificial neural networks? Join our Coding Junior company as an intern and unleash your potential in Python, machine learning, artificial intelligence, neural networks, data science, and deep learning. As a key member of our team, you will have the opportunity to work on cutting-edge projects and gain valuable hands-on experience. Selected intern's day-to-day responsibilities include: 1. Collaborating with senior team members to develop and implement neural network models 2. Conducting research and analysis to enhance existing algorithms and improve performance 3. Assisting in data collection, preprocessing, and feature engineering for machine learning projects 4. Participating in code reviews and contributing to the continuous improvement of coding practices 5. Supporting the troubleshooting and debugging of neural network architectures 6. Staying current on industry developments and trends in artificial intelligence and machine learning 7. Contributing innovative ideas to drive the company's growth and success If you are eager to learn and grow in a dynamic environment, apply now and take your career to the next level with us!",
    "skills": [
      "Artificial intelligence",
      "Data Science",
      "Deep Learning",
      "Machine Learning",
      "Neural Networks",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2738334",
    "jobTitle": "Generative AI",
    "companyName": "Quantum IT Innovation",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "₹ 10,000 - 15,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-generative-ai-internship-at-quantum-it-innovation1742977622",
    "description": "Selected intern's day-to-day responsibilities include: 1. Collaborate with our team of experts to research and develop innovative algorithms for quantum computing applications 2. Utilize your expertise in Generative AI to design and implement machine learning models for quantum information processing 3. Assist in the optimization and training of AI algorithms to improve performance and efficiency 4. Contribute to the analysis and interpretation of data to drive actionable insights and innovations 5. Stay current with the latest advancements in AI and quantum computing to enhance project outcomes 6. Engage in hands-on experimentation and testing to validate the effectiveness of AI solutions 7. Communicate your findings and recommendations effectively to contribute to the overall success of our projects",
    "skills": [
      "Machine Learning",
      "Certificate",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737835",
    "jobTitle": "Machine Learning",
    "companyName": "Aadhvik Technologies",
    "location": "Work from home",
    "duration": "1 Month",
    "stipend": "₹ 1,000 - 2,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-machine-learning-internship-at-aadhvik-technologies1742966788",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assisting in the development and implementation of machine learning models for various projects 2. Conducting research and analysis to improve existing algorithms and models 3. Collaborating with the team to gather and clean data for training models 4. Testing and evaluating the performance of machine learning models 5. Participating in team meetings and brainstorming sessions to contribute innovative ideas 6. Keeping up-to-date with the latest trends and advancements in the field of machine learning 7. Presenting findings and insights to the team in a clear and concise manner",
    "skills": [
      "Machine Learning",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "25 Apr' 25",
    "applyBy": "25 Apr' 25"
  },
  {
    "internshipId": "2737836",
    "jobTitle": "Data Science",
    "companyName": "Aadhvik Technologies",
    "location": "Work from home",
    "duration": "1 Month",
    "stipend": "₹ 1,000 - 2,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-data-science-internship-at-aadhvik-technologies1742911313",
    "description": "As a data science intern at Aadhvik Technologies, you will have the opportunity to work on cutting-edge projects that will shape the future of our company. Your role will involve analyzing and interpreting complex data sets to provide valuable insights and recommendations. You will work closely with our team of experienced data scientists to develop models and algorithms that drive business growth and innovation. This internship will provide you with hands-on experience in a fast-paced and dynamic environment, allowing you to expand your skills and knowledge in the field of data science. Selected intern's day-to-day responsibilities include: 1. Conduct data analysis and create visualizations to communicate findings 2. Assist in developing machine learning models and algorithms 3. Collaborate with cross-functional teams to solve business problems 4. Clean and preprocess large datasets for analysis 5. Support the implementation of data-driven solutions 6. Stay current on industry trends and best practices in data science",
    "skills": [
      "Data Science",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2737420",
    "jobTitle": "Artificial Intelligence (AI)",
    "companyName": "Still Travelling",
    "location": "Work from home",
    "duration": "3 Months",
    "stipend": "₹ 15,000 - 20,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-artificial-intelligence-ai-internship-at-still-travelling1742897246",
    "description": "Selected intern's day-to-day responsibilities include: 1. Develop and refine AI agents to assist in travel planning and itinerary generation 2. Build generative AI-powered applications and APIs 3. Manage DevOps tasks and perform application testing 4. Experiment and craft effective prompts for LLMs to generate accurate and relevant outputs 5. Analyze and fine-tune agent model behavior for diverse user scenarios 6. Design benchmarking datasets to test and validate the AI's understanding and responsiveness 7. Evaluate and benchmark the quality of AI outputs and suggest prompt adjustments 8. Stay updated with OpenAI and NLP advancements to enhance product capabilities 9. Develop agentic applications and APIs that integrate with backend systems and apps 10. Explore prompt engineering techniques to improve AI relevance and creativity 11. Collaborate with product managers, designers, and developers to align AI outputs with product goals",
    "skills": [
      "APIs",
      "Artificial intelligence",
      "ChatGPT",
      "Data Science",
      "Gemini",
      "LangChain",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Python",
      "REST API",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2737438",
    "jobTitle": "Artificial Intelligence (AI)",
    "companyName": "Experiences.digital",
    "location": "Gurgaon",
    "duration": "3 Months",
    "stipend": "₹ 2,500 - 5,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/artificial-intelligence-ai-internship-in-gurgaon-at-experiencesdigital1742892678",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in the integration of Google Gemini/ChatGPT in our existing e-commerce system 2. Create APIs for such integration 3. Handle web scraping for multiple functionality and then integration with our system via APIs",
    "skills": [
      "Artificial intelligence",
      "Natural Language Processing (NLP)",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2736533",
    "jobTitle": "Software Development",
    "companyName": "Marco Analytica",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "₹ 15,000 - 40,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-software-development-internship-at-marco-analytica1742879617",
    "description": "At Marco Analytica, interns are full contributors not coffee fetchers. You'll be working closely with our global team to build and refine GlobeView/OpenIntelWatch, a cutting-edge OSINT and intelligence visualization platform. Selected intern's day-to-day responsibilities include: 1. Backend Developers will work on scalable APIs, data pipelines, and backend infrastructure using Node.js, Python, or Java. You may also contribute to our custom web scraping and data ingestion tools. 2. Frontend Developers will help craft sleek, intuitive dashboards and interactive tools using React, Next.js, and modern design frameworks. 3. AI/ML Engineers will work with open-source LLMs like LLaMA, Mistral, or DeepSeek helping us fine-tune and optimize models for intelligence tasks. You'll also have opportunities to collaborate in team meetings, contribute ideas, and see your work deployed in real-world applications. This is your chance to build something meaningful at scale.",
    "skills": [
      "CSS",
      "HTML",
      "Java",
      "JavaScript",
      "MySQL",
      "Node.js",
      "Python",
      "React",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2737089",
    "jobTitle": "Gen AI Developer",
    "companyName": "Algo Root Private Limited",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "₹ 8,500 - 12,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-gen-ai-developer-internship-at-algo-root-private-limited1742878412",
    "description": "Selected intern's day-to-day responsibilities include: 1. Utilize AI Co-Pilot tools - intelligent assistants that help users generate, suggest, or automate code/content 2. Implement Document Extraction tools - extracting structured data from unstructured documents (invoices, contracts, sales orders, etc.) 3. Design, develop, and improve Gen AI-powered Co-Pilot systems using LLMs 4. Build document extraction pipelines using OCR, NLP, and Gen AI techniques 5. Integrate LLMs like GPT, Gemini, Claude, or open-source models (e.g., Llama, Mistral) 6. Work on prompt engineering, fine-tuning, and Retrieval-Augmented Generation (RAG) 7. Develop web-based UIs or APIs for testing/exposing Gen AI functionalities 8. Collaborate with the UI/UX team to bring intelligent user assistance features",
    "skills": [
      "Artificial intelligence",
      "Data Science",
      "Deep Learning",
      "Generative AI Development",
      "Generative AI Tools",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Neural Networks",
      "Python",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2737023",
    "jobTitle": "Audio AI - Machine Learning Engineer",
    "companyName": "Soundverse AI",
    "location": "Work from home",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-audio-ai-machine-learning-engineer-internship-at-soundverse-ai1742878144",
    "description": "Are you passionate about the intersection of machine learning, artificial intelligence, and audio technology? Join us at Soundverse AI as an audio AI - machine learning engineer intern and help us revolutionize the way we interact with sound. Selected intern's day-to-day responsibilities include: 1. Develop and implement machine learning models to enhance our audio AI technology. 2. Collaborate with our engineering team to integrate machine learning operations (MLOps) into our development process. 3. Research and experiment with new AI techniques to improve our audio algorithms. 4. Work on data preprocessing and feature engineering for our AI models. 5. Assist in the optimization and scaling of our machine learning pipelines. 6. Contribute to the testing and validation of our AI systems. 7. Stay up-to-date with the latest advancements in machine learning and audio AI technology. If you're looking to gain hands-on experience in a cutting-edge AI company and have a strong background in machine learning, apply now to join our team!",
    "skills": [
      "Artificial intelligence",
      "Machine Learning",
      "Machine Learning Operations (MLOps)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2736907",
    "jobTitle": "Artificial Intelligence (AI)",
    "companyName": "Lateral Works Studio",
    "location": "Vasai",
    "duration": "6 Months",
    "stipend": "₹ 5,000 - 10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/artificial-intelligence-ai-internship-in-vasai-at-lateral-works-studio1742877184",
    "description": "Selected intern's day-to-day responsibilities include: 1. Operate Comfy UI 2. Utilize a video-generating AI platform 3. Demonstrate AI generative media space understanding",
    "skills": [
      "Artificial intelligence",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2736913",
    "jobTitle": "Technology Lead",
    "companyName": "Resolute AI Software Private Limited",
    "location": "Work from home",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-technology-lead-internship-at-resolute-ai-software-private-limited1742821306",
    "description": "Selected intern's day-to-day responsibilities include: 1. Lead a team of developers, ensuring the timely delivery of high-quality solutions. 2. Design, develop, and debug applications in Android, Kotlin, JAVA, Python, Flutter, iOS, and website development. 3. Provide technical support and resolve client issues effectively, demonstrating excellent communication skills. 4. Architect scalable and secure solutions leveraging cloud services such as AWS, GCP, and Azure. 5. Monitor and troubleshoot software applications to ensure seamless functionality and performance. 6. Collaborate with stakeholders to gather requirements and define technical roadmaps. 7. Stay updated with emerging technologies, particularly in AI computer vision systems and Large Language Models (LLMs). 8. Recommend and implement the best cloud service solutions tailored to project needs. 9. Maintain documentation for system designs, configurations, and technical processes. Key Qualifications: 1. Minimum 3-4 years of experience required. 2. Educational Background: Bachelor's/master's degree in computer science, Engineering, or a related field. 3. Proficiency in Android, Kotlin, JAVA, Python, Flutter, Firebase, iOS, and website development. 4. Experience with GCP, Google Cloud Console, Azure, and AWS. 5. Familiarity with the OpenAI platform and its integrations. 6. Understanding of AI computer vision systems and LLMs is a plus. 7. Problem-Solving Skills 8. Leadership Skills 9. Communication Skills 10. Architecture Skills",
    "skills": [
      "Amazon Web Services (AWS)",
      "Android",
      "Artificial intelligence",
      "DevOps",
      "Docker",
      "Firebase",
      "Flutter",
      "iOS",
      "Java",
      "Kotlin",
      "Kubernetes",
      "Machine Learning",
      "Microsoft Azure",
      "Python",
      "Certificate",
      "Flexible work hours",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "23 Apr' 25",
    "applyBy": "23 Apr' 25"
  },
  {
    "internshipId": "2735984",
    "jobTitle": "Artificial Neural Networks",
    "companyName": "Vignesh Skanda",
    "location": "Work from home",
    "duration": "3 Months",
    "stipend": "Unpaid",
    "postedTime": "2 days ago",
    "activelyHiring": "No",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-artificial-neural-networks-internship-at-vignesh-skanda1742816040",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in developing and fine-tuning machine learning models, particularly in NLP. 2. Preprocess and analyze structured and unstructured medical datasets. 3. Implement and optimize deep learning techniques for text processing and classification. 4. Collaborate with the team to enhance chatbot capabilities, including intent recognition and contextual understanding. 5. Conduct research on the latest AI advancements and propose innovative approaches. 6. Deploy, test, and evaluate AI models to ensure high performance and reliability.",
    "skills": [
      "Artificial intelligence",
      "Data Science",
      "Data Structures",
      "Deep Learning",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "23 Apr' 25",
    "applyBy": "23 Apr' 25"
  },
  {
    "internshipId": "2736780",
    "jobTitle": "Python Development",
    "companyName": "Moneyy.ai",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "₹ 5,000 - 10,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-python-development-internship-at-moneyyai1742814511",
    "description": "Selected intern's day-to-day responsibilities include: 1. Collaborate with the team to develop and optimize algorithmic trading strategies. 2. Contribute to improving the performance and scalability of trading algorithms. 3. Gain exposure to cloud platforms and automation tools used in financial technology. 4. Work on real-time data processing and API integration for back-end services. 5. Assist in building and maintaining scalable, secure, and efficient back-end systems using Python. 6. Contribute to improving the performance and scalability of web applications. 7. Gain exposure to cloud platforms and automation tools used in financial technology.",
    "skills": [
      "CSS",
      "Django",
      "HTML",
      "Machine Learning",
      "Python",
      "REST API",
      "Certificate",
      "Letter of recommendation",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "23 Apr' 25",
    "applyBy": "23 Apr' 25"
  },
  {
    "internshipId": "2736479",
    "jobTitle": "Artificial Intelligence (AI)",
    "companyName": "Across The Globe (ATG)",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "₹ 2,500 - 5,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-artificial-intelligence-ai-internship-at-across-the-globe-atg1742799445",
    "description": "Selected intern's day-to-day responsibilities include: 1. Working on real projects on ML/AI/NLP stack and building our existing AI stack 2. Handling the research, modeling, and prototyping of ML techniques generating data insights and optimizations 3. Working on algorithm and model development of advanced technologies in text processing and data analytics 4. Working on data capturing, analyzing, validating, and developing codes/scripts in a regression environment 5. Supporting the AI Team with all ongoing and new software development activities 6. Developing scalable code for key machine learning pipelines",
    "skills": [
      "Computer Vision",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Neural Networks",
      "Certificate",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "23 Apr' 25",
    "applyBy": "23 Apr' 25"
  },
  {
    "internshipId": "2734138",
    "jobTitle": "Convolution Neural Network",
    "companyName": "Tech Jose",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "Unpaid",
    "postedTime": "2 days ago",
    "activelyHiring": "No",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-convolution-neural-network-internship-at-tech-jose1742796747",
    "description": "Selected intern's day-to-day responsibilities include: 1. Develop and implement Convolutional Neural Network (CNN) architectures using TensorFlow/PyTorch. 2. Apply machine learning concepts to real-world problems. 3. Train and optimize CNN models for image classification, object detection, and other vision tasks. 4. Continuously learn and adapt to new advancements in deep learning. 5. Contribute to research and development efforts in AI and neural networks.",
    "skills": [
      "Computer Vision",
      "Deep Learning",
      "Machine Learning",
      "Neural Networks",
      "Python",
      "Certificate",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "23 Apr' 25",
    "applyBy": "23 Apr' 25"
  },
  {
    "internshipId": "2735932",
    "jobTitle": "Artificial Intelligence (AI)",
    "companyName": "Algo Root Private Limited",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "₹ 8,500 - 12,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-artificial-intelligence-ai-internship-at-algo-root-private-limited1742793901",
    "description": "As an AI/ML intern, you will work on designing, implementing, and optimizing machine learning models and AI solutions. You will collaborate with data scientists, engineers, and product managers to solve complex challenges and develop scalable AI systems for real-world applications. Selected intern's day-to-day responsibilities include: 1. Design, develop, and implement machine learning models and algorithms for various applications. 2. Preprocess and clean datasets to ensure high-quality input for training models. 3. Train, evaluate, and fine-tune models for tasks like classification, regression, clustering, NLP, or computer vision. 4. Collaborate with the engineering team to integrate models into production systems. 5. Use frameworks such as TensorFlow, PyTorch, Scikit-learn, or Keras for model development. 6. Analyze model performance and improve accuracy, efficiency, and scalability. 7. Work with structured and unstructured data from sources such as APIs, databases, or files. 8. Stay updated with the latest advancements in AI/ML technologies and research.",
    "skills": [
      "Artificial intelligence",
      "Data Science",
      "Deep Learning",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Neural Networks",
      "Python",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "23 Apr' 25",
    "applyBy": "23 Apr' 25"
  },
  {
    "internshipId": "2734580",
    "jobTitle": "Mobile App Development",
    "companyName": "Pranakshit IT Solutions Private Limited",
    "location": "Hyderabad",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "No",
    "detailsUrl": "https://internshala.com/internship/detail/mobile-app-development-internship-in-hyderabad-at-pranakshit-it-solutions-private-limited1742643934",
    "description": "Are you passionate about mobile app development and eager to gain real-world experience in a dynamic tech company? Pranakshit IT Solutions Private Limited is seeking a talented Mobile App Development intern to join our team. Selected intern's day-to-day responsibilities include: 1. Collaborate with our experienced developers to design and implement cutting-edge mobile applications using Java, Python, and React Native. 2. Utilize your skills in machine learning and artificial intelligence to enhance the functionality and user experience of our apps. 3. Conduct research and stay updated on the latest trends and technologies in mobile app development. 4. Assist in troubleshooting and debugging issues to ensure smooth performance of our apps. 5. Contribute to brainstorming sessions and offer innovative ideas for new app features and improvements. 6. Work closely with the design team to create visually appealing and user-friendly interfaces. 7. Participate in code reviews and provide constructive feedback to help maintain high coding standards. If you are a motivated and creative individual with a strong background in mobile app development, this internship opportunity is perfect for you. Join us at Pranakshit IT Solutions and take your skills to the next level!",
    "skills": [
      "Artificial intelligence",
      "Java",
      "Machine Learning",
      "Python",
      "React Native",
      "Certificate",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "21 Apr' 25",
    "applyBy": "21 Apr' 25"
  },
  {
    "internshipId": "2735492",
    "jobTitle": "Artificial Intelligence (AI)",
    "companyName": "Abhimanyu  Singhal",
    "location": "Faridabad",
    "duration": "3 Months",
    "stipend": "₹ 5,000 - 7,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/artificial-intelligence-ai-internship-in-faridabad-at-abhimanyu-singhal1742630249",
    "description": "As an AI intern at Abhimanyu Singhal company, you will have the opportunity to work on cutting-edge projects in the field of Artificial Intelligence. You will collaborate with a team of experts to develop and implement innovative solutions using AI, Data Science, and Deep Learning technologies. 1. Assist in the development of AI models for various applications. 2. Conduct research and analysis to improve AI algorithms and processes. 3. Work on data preprocessing and feature engineering tasks. 4. Support the team in building and optimizing machine learning models. 5. Collaborate with other interns and team members on AI projects. 6. Participate in brainstorming sessions and contribute ideas for AI projects. 7. Stay updated on the latest advancements in AI technologies and trends. This internship will provide you with hands-on experience in the field of AI, allowing you to enhance your skills and knowledge while making a valuable contribution to the company's projects. Join us and be a part of our exciting journey in the world of Artificial Intelligence!",
    "skills": [
      "Artificial intelligence",
      "Data Science",
      "Deep Learning",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2735410",
    "jobTitle": "Data Science",
    "companyName": "AI4SEE PRIVATE LIMITED",
    "location": "Bangalore",
    "duration": "3 Months",
    "stipend": "₹ 3,000 - 5,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/data-science-internship-in-bangalore-at-ai4see-private-limited1742625617",
    "description": "Selected intern's day-to-day responsibilities include: 1. Reading and surveying state-of-the-art papers. 2. Working on data collection and preprocessing. 3. Building and evaluating ML models. 4. Analyzing and optimizing the models. 5. Handling documentation.",
    "skills": [
      "Algorithms",
      "Artificial intelligence",
      "Data Analytics",
      "Data Science",
      "Deep Learning",
      "Machine Learning",
      "Mathematics",
      "Natural Language Processing (NLP)",
      "Python",
      "Statistics",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "21 Apr' 25",
    "applyBy": "21 Apr' 25"
  },
  {
    "internshipId": "2735273",
    "jobTitle": "Artificial Intelligence And Machine Learning - Content Writing",
    "companyName": "Earth5R",
    "location": "Work from home",
    "duration": "1 Month",
    "stipend": "Unpaid",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-artificial-intelligence-and-machine-learning-content-writing-internship-at-earth5r1742619179",
    "description": "Selected intern's day-to-day responsibilities include: 1. Research various aspects of sustainability in artificial intelligence and machine learning 2. Work on data collection and analysis by studying various web resources related to artificial intelligence and machine learning 3. Enroll in volunteering modules and challenges available on the app 4. Publish your research through posts on the Earth5R app",
    "skills": [
      "Artificial intelligence",
      "Blogging",
      "C++ Programming",
      "Content Writing",
      "C Programming",
      "Java",
      "JavaScript",
      "Machine Learning",
      "Neural Networks",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "21 Apr' 25",
    "applyBy": "21 Apr' 25"
  },
  {
    "internshipId": "2734801",
    "jobTitle": "ML & AI Development Trainee",
    "companyName": "Brightrays",
    "location": "Faridabad, Delhi, Gurgaon, Greater Noida, Noida",
    "duration": "3 Months",
    "stipend": "₹ 20,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/ml-ai-development-trainee-internship-in-multiple-locations-at-brightrays1742562695",
    "description": "Selected intern's day-to-day responsibilities include: 1. Develop and Deploy AI Models - Work with open-source AI models, fine-tune them for specific use cases, and deploy them efficiently. 2. Python Programming - Write clean, efficient Python code for AI model training, data processing, and automation tasks. 3. AI Tools and APIs - Utilize AI tools like ChatGPT, integrate APIs, and automate tasks for content generation and decision-making. 4. Language Model Training (LLM) - Train, fine-tune, and optimize large language models (LLMs) for improved performance and contextual accuracy. 5. Data Processing &amp; Analysis - Clean, preprocess, and analyze datasets to improve model performance and scalability. 6. Optimize AI Performance - Continuously test, refine, and enhance AI models to ensure accuracy, efficiency, and real-world usability. 7. Stay Updated on AI Trends - Research the latest advancements in AI, ML, and LLMs to implement innovative solutions in content media and publishing.",
    "skills": [
      "APIs",
      "Artificial intelligence",
      "Data Analytics",
      "Data Science",
      "Java",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "24 Apr' 25",
    "applyBy": "24 Apr' 25"
  },
  {
    "internshipId": "2734587",
    "jobTitle": "Artificial Intelligence (AI)",
    "companyName": "Hooman Digital LLP",
    "location": "Work from home",
    "duration": "3 Months",
    "stipend": "₹ 15,000-20,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-artificial-intelligence-ai-internship-at-hooman-digital-llp1742544750",
    "description": "We are looking for a curious AI/ML Engineer passionate about pushing the boundaries of generative AI and Large Language Models (LLMs). You'll design, build, and optimize cutting-edge LLMs, drive innovation in NLP/ML systems, and collaborate to solve complex real-world challenges. Key Responsibilities: 1. Design and deploy generative AI models (LLMs, NLP systems) for diverse applications. 2. Innovate in LLM architectures, fine-tuning, and optimization for scalability and performance. 3. Experiment with LLMs like causal reasoning, RLHF, and neural architecture search. Collaborate with cross-functional teams to translate research into production-ready solutions. 4. Document methodologies and share knowledge to advance team capabilities. Requirements: 1. Experience: 1+ years building LLMs/GenAI systems; hands-on work with frameworks like PyTorch, Hugging Face, or TensorFlow. 2. Skills: Proficiency in Python, cloud platforms (AWS/Azure/GCP), MLOps tools (Docker, MLflow), and NLP/deep learning. 3. Mindset: Track record of creative problem-solving, open-source contributions, or research publications (a plus). 4. Soft Skills: Strong communication, collaboration, and a growth-oriented attitude. We Value: 1. Unstoppable curiosity to explore new AI frontiers. 2. Passion for experimentation and learning from iterative results. Apply With: Resume, portfolio of AI projects, and a cover letter. Include GitHub, research links, or open-source contributions. Let's redefine AI together!",
    "skills": [
      "Artificial intelligence",
      "Data Science",
      "Deep Learning",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "20 Apr' 25",
    "applyBy": "20 Apr' 25"
  },
  {
    "internshipId": "2734282",
    "jobTitle": "ML/Data Curation Engineer",
    "companyName": "Momenta",
    "location": "Work from home",
    "duration": "4 Months",
    "stipend": "$ 500-1,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-ml-data-curation-engineer-internship-at-momenta1742540936",
    "description": "Selected intern's day-to-day responsibilities include: 1. Perform data acquisition and manage datasets efficiently 2. Execute data cleaning and preprocess data for analysis 3. Carry out annotation and ensure quality assurance of datasets 4. Apply basic signal processing techniques and understand ML fundamentals 5. Demonstrate soft skills and maintain a continuous learning attitude",
    "skills": [
      "Machine Learning",
      "Python",
      "Training and Development",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "20 Apr' 25",
    "applyBy": "20 Apr' 25"
  },
  {
    "internshipId": "2734333",
    "jobTitle": "Data Science",
    "companyName": "Accredian",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-data-science-internship-at-accredian1742536771",
    "description": "As a data science content specialist intern, you will be at the intersection of data science and content creation, helping to communicate complex data insights in an accessible and engaging manner. This role is perfect for someone who has a knack for storytelling with data, enjoys writing, and is eager to gain hands-on experience in both data science and content development. Selected intern's day-to-day responsibilities include: 1. Work with the data science team to understand educational data projects and translate technical findings into clear, engaging content for educators, students, and stakeholders 2. Develop and write a variety of content types, including blog posts, case studies, reading material, educational resources, and social media posts that highlight our data-driven educational initiatives 3. Assist in creating data visualizations and infographics to support and enhance written content 4. Research current trends in data science, AI advancements, and other competitor activities to inform and enrich content creation 5. Collaborate with the marketing team to provide data-driven insights that optimize our content strategy 6. Participate in team meetings and brainstorming sessions to generate new content ideas and strategies 7. Work as a teaching assistant for live sessions hosted on the weekends",
    "skills": [
      "Deep Learning",
      "Machine Learning",
      "Power BI",
      "Python",
      "R Programming",
      "SQL",
      "Video Editing",
      "Video Making",
      "Certificate",
      "Flexible work hours",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "20 Apr' 25",
    "applyBy": "20 Apr' 25"
  },
  {
    "internshipId": "2731772",
    "jobTitle": "Data Science",
    "companyName": "Biztel.ai",
    "location": "Work from home",
    "duration": "4 Months",
    "stipend": "₹ 12,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-data-science-internship-at-biztelai1742447708",
    "description": "Selected intern's day-to-day responsibilities include: 1. Write production-level code in Python 2. Write FAST/FLASK APIs in python 3. Handle multi-domain data, including images, text, and numerical information. 4. Develop classification models and implement semantic search techniques. 5. Work on multimodal LLM applications to enhance functionality. 6. Perform advanced exploratory data analysis (EDA) on both conventional and non-conventional data. 7. Work with multimodal LLMs and their applications. 8. Handle multi-domain data, including images, text, and numerical information.",
    "skills": [
      "Artificial intelligence",
      "Data Science",
      "FastAPI",
      "Flask",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "19 Apr' 25",
    "applyBy": "19 Apr' 25"
  },
  {
    "internshipId": "2729240",
    "jobTitle": "Artificial Intelligence Agent Developer",
    "companyName": "Bijon Trading Private Limited (Genotek)",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month +  Incentives",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-artificial-intelligence-agent-developer-internship-at-bijon-trading-private-limited-genotek1742446773",
    "description": "Project title: AI-powered sales manager assistant and CRM with Whatsapp as primary UI. We are developing an AI-powered sales manager assistant to optimize our sales team's performance by acting as a constant companion, advisor, and personal assistant. This AI will address common issues faced by field sales agents, especially those without extensive training, and emulate the practices of high-performing sales professionals. Selected intern's day-to-day responsibilities include: 1. Assist in developing AI/ML models for sales automation and chatbots. 2. Work with NLP, LLMs, and deep learning models to enhance AI interactions. 3. Support API development and AI integrations. 4. Automate data extraction and processing using Python and Selenium. 5. Collaborate with the team on SaaS-based AI projects. 6. Research and stay updated on AI advancements.",
    "skills": [
      "APIs",
      "Artificial intelligence",
      "Deep Learning",
      "Machine Learning",
      "Neural Networks",
      "Python",
      "Selenium",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "19 Apr' 25",
    "applyBy": "19 Apr' 25"
  },
  {
    "internshipId": "2732433",
    "jobTitle": "Blockchain Development",
    "companyName": "Bumi",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "₹ 10,000-30,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-blockchain-development-internship-at-bumi1742443369",
    "description": "We are looking for a Blockchain/Crypto Strategist who specializes in algorithmic trading, quantitative analysis, and profitability-driven crypto trading development. This role is ideal for someone who understands how to leverage data, and market structures to maximize returns and mitigate risks. Key Focus: Designing, backtesting, and deploying high-performing trading strategies using Python, while ensuring security, compliance, and market adaptability. Selected intern's day-to-day responsibilities include: 1. Develop, test, and optimize algorithmic trading strategies to achieve consistent positive ROI. 2. Utilize historical and real-time market data to refine strategies and improve execution performance. 3. Implement and fine-tune back testing and forward-testing frameworks to validate strategy robustness. 4. Identify and mitigate trading risks such as slippage, market impact, and liquidity constraints. 5. Ensure API security and compliance while integrating with exchanges (Binance, Coinbase, Kraken, etc.). 6. Stay updated with crypto market trends, DeFi innovations, and quantitative research to maintain a competitive edge. 7. Work closely with engineering, product, and security teams to enhance trading infrastructure.",
    "skills": [
      "Algorithms",
      "APIs",
      "Machine Learning",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "19 Apr' 25",
    "applyBy": "19 Apr' 25"
  },
  {
    "internshipId": "2733074",
    "jobTitle": "Data Science",
    "companyName": "ADM EDUCATION & WELFARE SOCIETY",
    "location": "Work from home",
    "duration": "3 Months",
    "stipend": "Unpaid",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-data-science-internship-at-adm-education-welfare-society1742389600",
    "description": "We are seeking a dynamic Data Science intern to join our team. If you are passionate about data analysis, machine learning, artificial intelligence, and have experience with Python, SQL, and NLP, then this is the perfect opportunity for you. As a Data Science intern, you will have the opportunity to work on exciting projects and gain valuable hands-on experience in a fast-paced environment. Key Responsibilities: 1. Perform data analysis and provide insights to drive decision-making processes. 2. Develop and implement machine learning models for predictive analytics. 3. Collaborate with cross-functional teams to optimize data processing and analytics workflows. 4. Conduct research and experiments in the field of deep learning and AI. 5. Utilize NLP techniques to extract valuable information from unstructured data. 6. Write efficient code in Python to manipulate and analyze large datasets. 7. Assist in the development and implementation of data science solutions to address business challenges. If you are a motivated and innovative individual looking to kickstart your career in data science, then apply now to become a part of our team.",
    "skills": [
      "Artificial intelligence",
      "Data Analysis",
      "Data Analytics",
      "Data Science",
      "Deep Learning",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Python",
      "SQL",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "18 Apr' 25",
    "applyBy": "18 Apr' 25"
  },
  {
    "internshipId": "2732239",
    "jobTitle": "Deep Learning Instructor",
    "companyName": "Tutedude",
    "location": "Work from home",
    "duration": "1 Month",
    "stipend": "₹ 25,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-deep-learning-instructor-internship-at-tutedude1742360954",
    "description": "Are you a Deep Learning expert with a passion for AI, neural networks, and teaching? Tutedude is looking for an experienced Deep Learning Instructor to mentor aspiring AI professionals in mastering Neural Networks, CNNs, RNNs, Transformers, and Model Optimization. This is your opportunity to share your expertise, guide students, and make a meaningful impact in the field of Artificial Intelligence and Deep Learning. Selected intern's day-to-day responsibilities include: 1. Teach Deep Learning Concepts - Conduct engaging lessons on Artificial Neural Networks (ANNs), Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs), Transformers, and GANs. 2. Develop Curriculum - Design structured course materials, hands-on projects, and real-world case studies covering TensorFlow, PyTorch, backpropagation, and deep learning architectures. 3. Mentor Students - Provide hands-on guidance, feedback, and support to help students build, train, and optimize deep learning models. 4. Demonstrate Expertise - Showcase advanced techniques in transfer learning, hyperparameter tuning, model evaluation, and deployment. 5. Stay Updated - Keep up with the latest trends in AI research, deep learning frameworks, and cutting-edge neural network architectures. 6. Collaborate with Teams - Work with ML engineers, data scientists, and industry professionals to align course materials with real-world AI applications. 7. Evaluate Student Projects - Assess students' deep learning models, provide constructive feedback, and help them refine their model training and optimization techniques. 8. Organize Workflow - Teach students best practices in data preprocessing, GPU acceleration, cloud-based model deployment, and ethical AI considerations. If you're passionate about Deep Learning and AI-driven innovations and want to shape the next generation of AI professionals, apply now and make an impact!",
    "skills": [
      "Data Science",
      "Deep Learning",
      "Effective Communication",
      "Neural Networks",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "18 Apr' 25",
    "applyBy": "18 Apr' 25"
  },
  {
    "internshipId": "2732240",
    "jobTitle": "Data Science Instructor",
    "companyName": "Tutedude",
    "location": "Work from home",
    "duration": "1 Month",
    "stipend": "₹ 25,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-data-science-instructor-internship-at-tutedude1742360915",
    "description": "Are you a Data Science expert with a passion for data analytics, machine learning, and teaching? Tutedude is looking for an experienced Data Science Instructor to mentor aspiring data scientists in mastering statistical analysis, data visualization, machine learning, and AI-driven decision-making. This is your opportunity to share your expertise, guide students, and make a meaningful impact in the field of data science and analytics. Selected intern's day-to-day responsibilities include: 1. Teach Data Science Concepts - Conduct engaging lessons on data preprocessing, feature engineering, exploratory data analysis (EDA), machine learning algorithms, and model evaluation techniques. 2. Develop Curriculum - Design structured course materials, hands-on projects, and real-world case studies covering Python, R, SQL, NumPy, Pandas, Matplotlib, and Scikit-learn. 3. Mentor Students - Provide hands-on guidance, feedback, and support to help students develop strong data-driven problem-solving skills. 4. Demonstrate Expertise - Showcase advanced techniques in big data handling, deep learning, natural language processing (NLP), and AI-powered analytics. 5. Stay Updated - Keep up with the latest trends in data science, business intelligence, and AI-driven decision-making. 6. Collaborate with Teams - Work with industry professionals, AI engineers, and business analysts to align course materials with real-world data science applications. 7. Evaluate Student Projects - Assess students' machine learning models, data pipelines, and business analytics projects, providing constructive feedback. 8. Organize Workflow - Teach students best practices in data collection, cleaning, cloud computing for data science, and ethical AI considerations. If you're passionate about data-driven innovations and AI-powered decision-making and want to shape the next generation of data scientists, apply now and make an impact!",
    "skills": [
      "Artificial intelligence",
      "Data Science",
      "Deep Learning",
      "Effective Communication",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Neural Networks",
      "Statistical Modeling",
      "Statistics",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "18 Apr' 25",
    "applyBy": "18 Apr' 25"
  },
  {
    "internshipId": "2732243",
    "jobTitle": "MLOps Instructor",
    "companyName": "Tutedude",
    "location": "Work from home",
    "duration": "1 Month",
    "stipend": "₹ 25,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-mlops-instructor-internship-at-tutedude1742360808",
    "description": "Are you an MLOps expert with a passion for machine learning deployment, automation, and teaching? Tutedude is looking for an experienced MLOps Instructor to mentor aspiring ML engineers in mastering model deployment, CI/CD pipelines, and cloud-based ML solutions. This is your opportunity to share your expertise, guide students, and make a meaningful impact in the field of machine learning operations and AI deployment. Selected intern's day-to-day responsibilities include: 1. Teach MLOps Concepts - Conduct engaging lessons on ML model lifecycle management, continuous integration/continuous deployment (CI/CD), monitoring, and version control. 2. Develop Curriculum - Design structured course materials, hands-on projects, and real-world case studies covering Docker, Kubernetes, TensorFlow Serving, MLflow, and cloud platforms like AWS, GCP, and Azure. 3. Mentor Students - Provide hands-on guidance, feedback, and support to help students develop scalable and reproducible ML workflows. 4. Demonstrate Expertise - Showcase advanced techniques in automated model retraining, feature engineering pipelines, infrastructure as code (IaC), and model explainability. 5. Stay Updated - Keep up with the latest trends in AI automation, cloud-based ML, and DevOps for machine learning. 6. Collaborate with Teams - Work with industry professionals, AI engineers, and DevOps specialists to align course materials with modern MLOps practices. 7. Evaluate Student Projects - Assess students' ML deployment workflows, monitoring solutions, and optimization strategies, providing constructive feedback. 8. Organize Workflow - Teach students best practices in scalable ML, monitoring model drift, logging, and security in machine learning systems. If you're passionate about AI deployment, automation, and cloud-based machine learning solutions and want to shape the next generation of MLOps engineers, apply now and make an impact!",
    "skills": [
      "Amazon Web Services (AWS)",
      "Docker",
      "Effective Communication",
      "Google Cloud Platforms (GCP)",
      "Kubernetes",
      "Machine Learning",
      "Microsoft Azure",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "18 Apr' 25",
    "applyBy": "18 Apr' 25"
  },
  {
    "internshipId": "2732103",
    "jobTitle": "Machine Learning",
    "companyName": "Alemeno",
    "location": "Work from home",
    "duration": "3 Months",
    "stipend": "₹ 20,000-30,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-machine-learning-internship-at-alemeno1742360225",
    "description": "Alemeno, a dynamic and rapidly growing technology company, is seeking a talented Machine Learning Engineer with expertise across multiple ML domains including large language models, computer vision, and deep learning to join our team. Selected intern's day-to-day responsibilities include: 1. AI System Development - Design, develop, and maintain scalable AI systems integrating LLMs, Computer Vision, and Deep Learning 2. Collaboration &amp; Integration - Work with teams to implement AI solutions, ensuring seamless integration across applications 3. Computer Vision &amp; NLP - Develop and optimize vision algorithms for object detection and enhance text functionalities using NLP and LLMs 4. Deep Learning &amp; Model Optimization - Implement, fine-tune, and optimize deep learning architectures for efficiency and reliability 5. Code Quality &amp; Best Practices - Write clean, maintainable code, follow best practices, and participate in code reviews 6. Debugging &amp; Performance Tuning - Troubleshoot, debug, and enhance ML system performance for reliability 7. Continuous Learning - Stay updated with AI and ML advancements to drive innovation",
    "skills": [
      "Computer Vision",
      "Deep Learning",
      "Docker",
      "FastAPI",
      "Flask",
      "Git",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "OpenCV",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "18 Apr' 25",
    "applyBy": "18 Apr' 25"
  },
  {
    "internshipId": "2732205",
    "jobTitle": "Python Development",
    "companyName": "Think Act Rise Foundation",
    "location": "Work from home",
    "duration": "4 Months",
    "stipend": "₹ 15,000-25,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-python-development-internship-at-think-act-rise-foundation1742359211",
    "description": "Selected intern's day-to-day responsibilities include: 1. Utilize ChatGPT and OpenAI API for content generation and automation. 2. Perform web scraping using Selenium, BeautifulSoup, or other libraries. 3. Assist in Python scripting for automation and data processing. 4. Assist in Python scripting for automation and data processing.",
    "skills": [
      "Machine Learning",
      "Python",
      "REST API",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "18 Apr' 25",
    "applyBy": "18 Apr' 25"
  },
  {
    "internshipId": "2731946",
    "jobTitle": "Artificial Intelligence (AI)",
    "companyName": "Cynapto Technologies Private Limited",
    "location": "Work from home",
    "duration": "6 Months",
    "stipend": "₹ 5,000-15,000 /month",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-artificial-intelligence-ai-internship-at-cynapto-technologies-private-limited1742300831",
    "description": "Selected intern's day-to-day responsibilities include: 1. Working with the team to test and fix issues on the Python backend of the AI products 2. Working as part of the development/optimization process of CV/DL models 3. Providing support to the AI team Requirements: 1. Candidates who have personal PCs/laptops which are powerful enough for development 2. Candidates who have a fast and stable internet connection and other accessories required for working from home 3. Should have worked on projects using Python 4. Should have a basic understanding of machine learning and image processing technologies 5. Should have a basic understanding of audio and text processing 6. Should have basic OOP knowledge 7. Should be comfortable working on Windows and Linux operating systems 8. An understanding of code versioning tools such as Git",
    "skills": [
      "Computer Vision",
      "Deep Learning",
      "Machine Learning",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "17 Apr' 25",
    "applyBy": "17 Apr' 25"
  },
  {
    "internshipId": "2731654",
    "jobTitle": "Artificial Intelligence (AI)",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "1 Month",
    "stipend": "₹ 2,000 /month",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-artificial-intelligence-ai-internship-in-lucknow-at-digital-heroes1742291353",
    "description": "Selected intern's day-to-day responsibilities include: 1. Managing clients' communication as well as managing the hiring process 2. Checking the company website on Shopify and helping with other IT-related stuff 3. Managing a Youtube channel called \"Mindless Beings\" Note: 1. We will teach you all the required stuff if you are willing to learn then only apply to the job 2. Your adaptability will be tested on each step 3. Training will be WFH on different fields to test your adaptability and ability to learn 4. We need people who are passionate towards their work and can handle any obstacle that may come in between",
    "skills": [
      "Artificial intelligence",
      "Deep Learning",
      "Python",
      "Certificate",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "17 Apr' 25",
    "applyBy": "17 Apr' 25"
  },
  {
    "internshipId": "2723996",
    "jobTitle": "Android App Development",
    "companyName": "RN Inspire Services Private Limited",
    "location": "Sawai Madhopur",
    "duration": "2 Months",
    "stipend": "₹ 6,000 /month +  Incentives",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/android-app-development-internship-in-sawai-madhopur-at-rn-inspire-services-private-limited1742290077",
    "description": "We are looking for talented mobile app development interns to join us in building and developing some wonderful large-scale projects. If you are passionate about coding in Kotlin and have experience with mobile app development, then this is the perfect opportunity for you to gain real-world experience. You'll be given free-hand to develop the app from start to finish. The internship also offers an opportunity to join the company with full-time employment. Moreover, it can lead you to become a partner in the start-up. Selected intern's day-to-day responsibilities include: 1. Understanding functional requirements and building the apps until the go-live stage 2. Designing and implementing features as needed 3. Debugging and troubleshooting issues to ensure optimal performance and user experience 4. Conducting thorough testing to identify and fix any bugs or errors in the app 5. Researching and implementing the latest technologies and best practices in Android development 6. Assisting in the maintenance and updates of the app/s to keep it running smoothly 7. Communicating effectively with team members to ensure project deadlines are met",
    "skills": [
      "Android",
      "APIs",
      "Artificial intelligence",
      "Data Analytics",
      "Data Structures",
      "Firebase",
      "Flutter",
      "Kotlin",
      "Machine Learning",
      "UI & UX Design",
      "Web Application Security",
      "XML",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "17 Apr' 25",
    "applyBy": "17 Apr' 25"
  },
  {
    "internshipId": "2730245",
    "jobTitle": "Machine Learning",
    "companyName": "SN Mentoring",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "₹ 10,000-15,000 /month",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-part-time-machine-learning-internship-at-sn-mentoring1742273027",
    "description": "Selected intern's day-to-day responsibilities include: 1. Read, understand, and extract insights from various AI research papers 2. Learn to work on a deep learning framework and get familiar with data manipulation techniques 3. Collect data, perform experiments, and measure performance metrics 4. Prototype and experiment with various ML and deep learning techniques for performance and scalability 5. Deploy ML models on VM instances",
    "skills": [
      "Artificial intelligence",
      "Deep Learning",
      "Machine Learning",
      "Natural Language Processing (NLP)",
      "Python",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "17 Apr' 25",
    "applyBy": "17 Apr' 25"
  },
  {
    "internshipId": "2731129",
    "jobTitle": "Campus Ambassador",
    "companyName": "House Of Couton Private Limited",
    "location": "Work from home",
    "duration": "2 Months",
    "stipend": "Performance Based",
    "postedTime": "1 week ago",
    "activelyHiring": "No",
    "detailsUrl": "https://internshala.com/internship/detail/campus-ambassador-programme-at-house-of-couton-private-limited1742272404",
    "description": "Selected intern's day-to-day responsibilities include: 1. We need dynamic individuals to connect to placement cell of you college 2. Get them to sign up to use our Ai-hiring software https://aihirestudio.com/home for free trial. 3. Inform them about the utility of the tool and how they can use for placment. Someone who is in good terms with their placement cell or coordinator are best fit.",
    "skills": [
      "Artificial intelligence",
      "Computer Vision",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Machine Learning",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A",
    "applyByDate": "17 Apr' 25",
    "applyBy": "17 Apr' 25"
  }
]