[
  {
    "internshipId": "2730739",
    "jobTitle": "Sales Consultation",
    "companyName": "Baker's Belly",
    "location": "Bangalore",
    "duration": "2 Months",
    "stipend": "₹ 12,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/sales-consultation-internship-in-bangalore-at-bakers-belly1742212036",
    "description": "Selected intern's day-to-day responsibilities: 1. Utilize billing software for sales 2. Provide customer support 3. Assist in identifying and developing new sales opportunities 4. Create engaging and effective marketing campaigns using social media platforms 5. Collaborate with the marketing team to develop and implement sales strategies 6. Manage and maintain customer relationships 7. Handle day-to-day sales and operational tasks 8. Support various sales initiatives and projects",
    "skills": [
      "Marketing",
      "Operations",
      "Sales",
      "Social Media Marketing",
      "Tally",
      "Certificate",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2727558",
    "jobTitle": "Social Media Management",
    "companyName": "SadhakaJerry Holistic Wellness",
    "location": "Kochi",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/social-media-management-internship-in-kochi-at-sadhakajerry-holistic-wellness1741845421",
    "description": "Selected intern's day-to-day responsibilities: 1. Capture high-quality photographs and videos of meditation and sound healing sessions, workshops, and events 2. Edit and enhance visual content for social media and marketing materials 3. Maintain a consistent visual style that aligns with our brand identity 4. Manage and organize the media library for easy access to content 5. Plan and execute content strategies for social media platforms (Instagram, Facebook, YouTube, etc.) 6. Create engaging posts, reels, and stories using photos and videos from sessions 7. Develop a social media calendar to ensure consistent posting and engagement 8. Monitor engagement metrics and optimize content strategy accordingly 9. Respond to comments, messages, and inquiries on social media 10. Brainstorm and implement creative ideas for visual storytelling 11. Collaborate with the team to produce promotional materials and event highlights 12. Assist in website updates and visual branding efforts Requirements: 1. Demonstrate passion for photography, videography, and social media management 2. Show proficiency in Adobe Photoshop, Lightroom, Premiere Pro, or similar editing tools 3. Have a strong understanding of Instagram, Facebook, YouTube, and emerging social media trends 4. Exhibit passion for wellness, mindfulness, or meditation (preferred) 5. Work independently while collaborating with the team 6. Display good communication skills and a creative mindset",
    "skills": [
      "Content Writing",
      "Digital Marketing",
      "Photography",
      "Flexible work hours",
      "Informal dress code",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2717141",
    "jobTitle": "DevOps Engineering",
    "companyName": "HJ Infotech",
    "location": "Jaipur",
    "duration": "6 Months",
    "stipend": "₹ 5,000 /month",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/devops-engineering-internship-in-jaipur-at-hj-infotech1740659794",
    "description": "Selected intern's day-to-day responsibilities include: 1. Learn and implement various DevOps tools while automating manual processes. 2. Develop and manage infrastructure in the cloud. 3. Write automation scripts and work on infrastructure as code. 4. Collaborate with the team and clients to manage and optimize software solutions. 5. Provide remote assistance to clients based on their availability, including day and night shifts.",
    "skills": [
      "Amazon Web Services (AWS)",
      "Ansible",
      "Cloud Computing",
      "DevOps",
      "Docker",
      "Git",
      "Google Cloud Computing",
      "Jenkins",
      "Kubernetes",
      "Microsoft Azure",
      "Terraform",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730559",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Aap Ki Awaz Publication",
    "location": "Jaipur",
    "duration": "6 Months",
    "stipend": "₹ 10,000-30,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-jaipur-at-aap-ki-awaz-publication1742206638",
    "description": "Selected intern's day-to-day responsibilities: 1. Identify potential clients and new business opportunities in media, print media, and IT sectors 2. Research and compile lists of target companies and key decision-makers 3. Work on LinkedIn, email outreach, and other platforms for lead generation 4. Reach out to prospects via calls, emails, and social media to pitch services 5. Schedule and assist in client meetings, calls, and presentations 6. Maintain and nurture relationships with existing and potential clients 7. Assist in developing customized sales pitches and presentations based on client needs 8. Support in preparing proposals, quotations, and contracts for clients 9. Conduct research on industry trends, competitors, and market opportunities 10. Analyze client requirements and suggest suitable solutions or packages 11. Collaborate with marketing, design, and technical teams for proposal creation and delivery 12. Ensure timely communication and follow-ups with internal departments to meet client expectations 13. Maintain updated records of client interactions, sales pipeline, and follow-ups using CRM tools or Excel 14. Generate regular reports on sales activities and progress 15. Assist in planning and strategizing media campaigns and ad placements 16. Coordinate with publication houses, digital platforms, and vendors for media execution 17. Ensure smooth onboarding of new clients 18. Handle client queries and coordinate for timely delivery of services 19. Contribute ideas in team meetings to improve sales processes and client engagement 20. Stay updated with company offerings and help in creating go-to-market strategies 21. Prepare daily/weekly reports on business development activities 22. Document learnings, client feedback, and challenges faced during sales outreach",
    "skills": [
      "Content Marketing",
      "Content Writing",
      "Digital Marketing",
      "Effective Communication",
      "Email Marketing",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Marketing",
      "Marketing Strategies",
      "Market Research",
      "MS-Excel",
      "Sales",
      "Sales pitch",
      "Social Media Marketing",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2698059",
    "jobTitle": "Finance Operations",
    "companyName": "Delhivery Private Limited",
    "location": "Goa",
    "duration": "3 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/finance-operations-internship-in-goa-velha-at-delhivery-private-limited1738576288",
    "description": "Selected intern's day-to-day responsibilities include: 1. Receive, record, and process invoices accurately and in a timely manner. 2. Match invoices to receipts and reconcile business accounts to ensure accuracy. 3. Prepare checks and process payments to vendors, contractors, and suppliers. 4. Keep accurate records of suppliers, purchase orders, and outstanding payables. 5. Ensure all activities comply with financial policies, processes.",
    "skills": [
      "Data Analysis",
      "Effective Communication",
      "MS-Excel",
      "Certificate",
      "Letter of recommendation",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730920",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Lotlite Realtors",
    "location": "Pimpri-Chinchwad, Pune, Mahalunge, Wakad",
    "duration": "6 Months",
    "stipend": "₹ 6,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-lotlite-realtors1742272930",
    "description": "As a business development intern (field sales) at Lotlite Realtors Pvt Ltd, you will be responsible for generating leads, building client relationships, and driving sales growth in the real estate sector. This internship provides hands-on experience in field sales, business development, and customer engagement. Selected intern's day-to-day responsibilities include: 1. Conduct market research to identify potential clients and business opportunities. 2. Generate leads through various sales and marketing strategies, including cold calling, networking, and field visits. 3. Meet prospective clients, understand their property requirements, and present suitable real estate solutions. 4. Build and maintain strong relationships with clients, ensuring excellent customer service. 5. Collaborate with the sales team to achieve revenue targets. 6. Participate in property site visits and client meetings. 7. Maintain records of interactions and transactions with clients. 8. Provide feedback and insights to the management team to improve sales strategies.",
    "skills": [
      "Digital Marketing",
      "Effective Communication",
      "Email Marketing",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "Social Media Marketing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730937",
    "jobTitle": "Sales Consultant",
    "companyName": "Lotlite Realtors",
    "location": "Pimpri-Chinchwad, Pune, Mahalunge, Wakad",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/sales-consultant-internship-in-multiple-locations-at-lotlite-realtors1742273259",
    "description": "As a Microsoft certification sales intern at Lotlite Technology Pvt Ltd, you will be responsible for promoting and selling Microsoft certification programs to students, professionals, and corporate clients. This role involves lead generation, customer engagement, and sales strategy execution. Selected intern's day-to-day responsibilities include: 1. Conduct thorough market research to proactively identify potential clients interested in Microsoft certifications. 2. Generate qualified leads through various sales strategies, including cold calling, social media outreach, and networking. 3. Educate prospective clients effectively on the benefits and career advantages of Microsoft certifications. 4. Build and maintain strong, lasting relationships with individual learners, universities, and corporate training departments. 5. Collaborate closely with the sales team to consistently achieve revenue targets. 6. Maintain accurate records of interactions and transactions with clients. 7. Provide valuable feedback and actionable insights to the management team to enhance sales strategies. Join us at Lotlite Technology Pvt Ltd and kick-start your career in tech sales!",
    "skills": [
      "Effective Communication",
      "Market Analysis",
      "Marketing",
      "Marketing Strategies",
      "Sales pitch"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2727614",
    "jobTitle": "Human Resources (HR)",
    "companyName": "Reliable Allied Services",
    "location": "Delhi, Ghaziabad, Noida",
    "duration": "6 Months",
    "stipend": "₹ 4,000-6,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/human-resources-hr-internship-in-multiple-locations-at-reliable-allied-services1741759245",
    "description": "Selected intern's day-to-day responsibilities include: 1. Understanding job descriptions 2. Assessing the candidates (shortlisting, resume evaluation, and phone screening) 3. Calling up candidates and explaining the job details 4. Coordinating with candidates/clients for recruitment 5. Setting up the interviews 6. Lining up the candidates for the interview as per the schedule Additional points: 1. Incentive of INR 500 per hiring. 2. On successful completion of 3 months internship, the stipend will increase to 10-12k, and upon successful completion of another 3 months of training period you will be hired as an on-role recruiter.",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "MS-Word",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730741",
    "jobTitle": "Corporate Sales",
    "companyName": "PHARMINT PTE Limited",
    "location": "Delhi",
    "duration": "6 Months",
    "stipend": "₹ 20,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/corporate-sales-internship-in-delhi-at-pharmint-pte-limited1742212318",
    "description": "As a Corporate Sales intern at PHARMINT PTE Limited, you will have the opportunity to work with a dynamic team in the pharmaceutical industry. Your role will involve mastering the art of sales, delivering compelling sales pitches, and utilizing Salesforce to manage client interactions effectively. Your proficiency in spoken and written English will be essential in communicating with clients and colleagues. Selected intern's day-to-day responsibilities include: 1. Assist with the team and coordinate with the buyers, sellers, and executives. 2. Conduct market research to identify potential clients and business opportunities 3. Create and deliver engaging sales presentations to showcase our products and services 4. Collaborate with the sales team to build and maintain relationships with key accounts 5. Utilize Salesforce to track sales activities, manage leads, and monitor progress 6. Provide exceptional customer service and address any client inquiries or concerns promptly 7. Participate in training sessions to enhance your sales skills and knowledge of the pharmaceutical industry Join us at PHARMINT PTE Limited and gain valuable experience in corporate sales while making a meaningful impact in the healthcare sector. Apply now and take the first step towards a successful sales career!",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "Sales",
      "Salesforce",
      "Sales pitch",
      "Certificate",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2718230",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Rajat Talwar",
    "location": "Kanpur",
    "duration": "2 Months",
    "stipend": "₹ 7,000 /month",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-business-development-sales-internship-in-kanpur-at-rajat-talwar1740744425",
    "description": "Selected intern's day-to-day responsibilities: 1. Identify, develop, and maintain partnerships with sponsors, collaborators, and influencers to enhance the brand presence of \"The RST Show\" 2. Pitch sponsorship and advertising opportunities to potential clients and secure deals to drive revenue for the show 3. Conduct in-depth research on industry trends, competitors, and potential target markets to identify growth opportunities",
    "skills": [
      "Digital Marketing",
      "Effective Communication",
      "Sales",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733225",
    "jobTitle": "Industrial Design",
    "companyName": "Gudgudee",
    "location": "Bangalore",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/industrial-design-internship-in-bangalore-at-gudgudee1742406455",
    "description": "Selected intern's day-to-day responsibilities include: 1. Understand briefs for various projects from the design team and conceptualize ideas 2. Detail the designs of spaces, products, play elements with respect to scale, anthropometry, material feasibility, and budgets 3. Research about children, play, play theory, etc and for different materials, finishes, and processes 4. Coordinate with vendors and partners to ensure quality and timely execution of projects 5. Prepare execution timelines with the project manager and coordinate different projects simultaneously in a seamless fashion 6. Create and maintain a material library by looking for new materials and securing samples as directed by the design team",
    "skills": [
      "AutoCAD",
      "MS-PowerPoint",
      "Rhino",
      "SolidWorks",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731593",
    "jobTitle": "Teaching",
    "companyName": "TLC Playschool",
    "location": "Chennai",
    "duration": "6 Months",
    "stipend": "₹ 7,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/teaching-internship-in-chennai-at-tlc-playschool1742389048",
    "description": "Selected intern's day-to-day responsibilities include: 1. Develop lesson plans 2. Execute lessons 3. Work on documentation",
    "skills": [
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Teaching",
      "Certificate",
      "Letter of recommendation",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732922",
    "jobTitle": "Content Writing",
    "companyName": "Urbanroof",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writing-internship-in-pune-at-urbanroof1742384094",
    "description": "Selected intern's day-to-day responsibilities include: 1.Research and write engaging blogs, articles, and social media posts related to [industry-specific topics like interior design, home improvement, etc.]. Assist in creating compelling website content, email campaigns, and marketing materials. Optimize content for SEO and ensure alignment with brand voice. Conduct competitor analysis and suggest content strategies. Collaborate with designers and marketing team to enhance content visuals. Stay updated with industry trends and contribute innovative content ideas.",
    "skills": [
      "Blogging",
      "Creative Writing",
      "Design Thinking",
      "English Proficiency (Written)",
      "Search Engine Optimization (SEO)",
      "Storyboarding",
      "Certificate",
      "Letter of recommendation",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731302",
    "jobTitle": "Interior Designer Intern",
    "companyName": "Studio Moderio",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 10,000-13,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/interior-designer-intern-internship-in-pune-at-studio-moderio1742378609",
    "description": "Selected intern's day-to-day responsibilities include: 1. Drafting plans and elevations using software like AutoCAD and SketchUp. 2. Design Concepts, Material Selection and knowledge. 3. Assist in color coordination, material selection, and furniture choices. 4. Proactively participate in brainstorming sessions and problem-solving discussions. 5. Observe and assist with site supervision tasks. 6. Ensure accuracy in drafting for precise spatial planning. 7. Create realistic renders using tools like V-Ray, Twin motion or Lumion. 8. Effectively communicate and engage clients through the design process. 9. Attend client meetings and assist in documenting changes and feedback.",
    "skills": [
      "Effective Communication",
      "Time Management",
      "Certificate",
      "Letter of recommendation",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731030",
    "jobTitle": "Fund Marketing & Office Coordinator",
    "companyName": "Shubh Investment Partners",
    "location": "Work from home",
    "duration": "4 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-fund-marketing-office-coordinator-internship-at-shubh-investment-partners1742297805",
    "description": "Selected intern's day-to-day responsibilities include: 1. Conduct approximately 60 outbound calls per day to prospective investors, including wealthy individuals, family offices, and medical offices. 2. Present Shubh Investment Partners' value proposition and strategic approach clearly and compellingly to potential investors. 3. Build and maintain relationships with prospective clients through regular follow-ups and effective communication. 4. Schedule meetings and appointments to discuss investment opportunities with interested parties. 5. Collaborate with the marketing team to develop and refine outreach strategies and materials. 6. Keep detailed records of all interactions with potential investors in HubSpot CRM. 7. Stay informed about market trends, investment opportunities, and the competitive landscape. 8. Allocate 30% time on office work and administration. Non-negotiable work hours: 6:30 PM to 3 AM. Requirements: 1. Undergraduate students or those graduating within three months are preferred. 2. MBA is not mandatory. Candidates who have recently graduated or will graduate from an undergraduate or master's program within six months are eligible.",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Google Suite (G Suite)",
      "MS-Office",
      "Certificate",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732867",
    "jobTitle": "Graphic Design (Female)",
    "companyName": "Agarwal Classes",
    "location": "Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 10,000-14,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/graphic-design-female-internship-in-mumbai-at-agarwal-classes1742385868",
    "description": "Are you a talented Graphic Design student looking to gain real-world experience? Agarwal Classes is seeking a creative and skilled intern to join our team! With your expertise in Adobe Photoshop, Adobe Illustrator, CorelDRAW, and Video Editing, you'll have the opportunity to contribute to a variety of exciting projects. Selected intern's day-to-day responsibilities include: 1. Collaborate with the marketing team to create visually appealing graphics for social media, website, and promotional materials. 2. Assist in developing design concepts for new courses and events. 3. Produce engaging video content for online platforms. 4. Work on branding and logo design projects. 5. Help maintain and organize the digital asset library. 6. Support in creating print materials such as brochures and flyers. 7. Learn from experienced professionals in the field and gain valuable hands-on experience. If you're passionate about design and eager to learn, apply now to kickstart your career with Agarwal Classes!",
    "skills": [
      "Adobe Illustrator",
      "Adobe Photoshop",
      "CorelDRAW",
      "Video Editing",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2727788",
    "jobTitle": "Graphic Design",
    "companyName": "LEO1",
    "location": "Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/graphic-design-internship-in-mumbai-at-leo11741767558",
    "description": "Selected intern's day-to-day responsibilities include: Social Media Strategy &amp; Content Creation 1.Develop, curate, and schedule engaging content (text, image, and video) for Facebook, Instagram and LinkedIn. 2.Brainstorm / Research for new and creative approaches to social media campaigns and promotions. 3. Collaborate with In-house designers, content writers, and other team members to produce high-quality content. Social Media Calendar Management Develop, curate, and schedule engaging content (text, image, and video) for Facebook, Instagram and LinkedIn. Brainstorm / Research for new and creative approaches to social media campaigns and promotions. Collaborate with In-house designers, content writers, and other team members to produce high-quality content. Social Media Calendar Management Co-plan and maintain a detailed social media calendar aligned with brand objectives and marketing goals. Ensure timely postings and updates in line with campaign launches, events, and relevant seasonal themes. Track and adjust content plans based on performance and audience feedback. Community Management Respond/ Escalate promptly to comments, messages, and reviews across social channels. Foster positive user engagement, handle customer queries, and escalate issues as needed. Monitor brand mentions and conversations to identify trends and potential opportunities. Analytics &amp; Reporting Track and analyze key performance indicators (KPIs) such as reach, engagement, and conversions. Prepare periodic reports on social media performance and provide insights to enhance future strategies. Stay updated with the latest trends, algorithm changes, and best practices in social media marketing. Collaboration &amp; Coordination Work closely with cross-functional teams (Marketing, PR, Sales, etc.) to support integrated marketing efforts. Liaise with external agencies or influencers if required for campaign amplification. Static Graphic Designer Intern: Basic knowledge of Adobe Photoshop &amp; Illustrator Understanding of design principles, typography &amp; color theory Ability to work on social media &amp; marketing creatives Motion Graphics Designer Intern: Proficiency in Adobe Premiere Pro &amp; After Effects (along with Photoshop &amp; Illustrator) Ability to create animated graphics, motion videos &amp; short promotional content Interest in video editing &amp; visual storytelling",
    "skills": [
      "Digital Marketing",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733030",
    "jobTitle": "Social Media Marketing",
    "companyName": "Dolphin Ad World Private Limited",
    "location": "Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/social-media-marketing-internship-in-mumbai-at-dolphin-ad-world-private-limited1742387248",
    "description": "Are you a social media savvy individual with a passion for marketing and creative writing? Look no further! Dolphin Ad World Private Limited is seeking a talented Social Media Marketing intern to join our dynamic team. As our intern, you will have the opportunity to gain hands-on experience in managing social media platforms, creating engaging content, and analyzing campaign performance. Your English proficiency and knowledge of Instagram marketing will be put to the test as you work on stimulating projects that will help drive brand awareness and increase audience engagement. Key responsibilities: 1. Develop and implement social media marketing strategies 2. Create compelling content for various platforms 3. Manage and monitor social media accounts 4. Analyze data and generate reports on campaign performance 5. Collaborate with the marketing team on creative projects 6. Stay up-to-date on industry trends and best practices 7. Contribute innovative ideas to enhance our social media presence If you are a self-motivated individual with a strong work ethic and a love for all things social media, we want to hear from you! Join us at Dolphin Ad World Private Limited and take the first step towards a successful career in digital marketing. Apply now!",
    "skills": [
      "Creative Writing",
      "English Proficiency (Written)",
      "Instagram Marketing",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733037",
    "jobTitle": "Influencer Marketing",
    "companyName": "Dolphin Ad World Private Limited",
    "location": "Mumbai",
    "duration": "4 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/influencer-marketing-internship-in-mumbai-at-dolphin-ad-world-private-limited1742387562",
    "description": "Are you a savvy social media user with a passion for influencer marketing? We're looking for a dynamic Intern to join our team at Dolphin Ad World Private Limited. As an Influencer Marketing Intern, you will have the opportunity to work closely with our marketing team to create impactful campaigns, develop relationships with influencers, and drive engagement for our clients. Key Responsibilities: 1. Assist in developing influencer marketing strategies and campaigns 2. Identify and reach out to potential influencers for collaborations 3. Manage communication and negotiations with influencers 4. Monitor and analyze campaign performance and provide recommendations for optimization 5. Create engaging content for social media platforms 6. Collaborate with internal teams to ensure alignment on campaign objectives 7. Stay updated on industry trends and best practices in influencer marketing If you have excellent communication skills, a knack for problem-solving, and a strong command of the English language (both written and spoken), this internship opportunity is perfect for you. Join us and take your first step towards a successful career in influencer marketing!",
    "skills": [
      "Effective Communication",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Negotiation & Problem-solving",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732583",
    "jobTitle": "E-commerce Operations",
    "companyName": "Motoflux Automotive Solutions Private Limited (Car101)",
    "location": "Pune",
    "duration": "6 Months",
    "stipend": "₹ 7,000-15,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/e-commerce-operations-internship-in-pune-at-motoflux-automotive-solutions-private-limited-car1011742370572",
    "description": "Selected intern's day-to-day responsibilities include: 1. Process and manage online orders 2. Coordinate dispatch and delivery 3. Monitor RTOs and resolve customer issues 4. Work with our vibrant, young team",
    "skills": [
      "CRM",
      "Data Analysis",
      "Effective Communication",
      "MS-Excel",
      "Operations",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732958",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Webpulse Solution Private Limited",
    "location": "Delhi",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month +  Incentives",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-delhi-at-webpulse-solution-private-limited1742385195",
    "description": "As a Business Development (Sales) intern at Webpulse Solution Private Limited, you will have the opportunity to work closely with our dynamic sales team to drive revenue growth and expand our client base. Your English and Hindi proficiency will be a valuable asset in communicating with potential clients and understanding their needs. Key responsibilities: 1. Conduct market research to identify potential clients and industry trends. 2. Assist in creating and delivering sales presentations to prospects. 3. Develop and maintain relationships with existing clients to ensure customer satisfaction and retention. 4. Collaborate with the sales team to develop strategies for acquiring new business. 5. Attend networking events and conferences to represent the company and generate leads. 6. Assist in the negotiation and closing of sales deals. 7. Provide regular updates and reports on sales activities to the sales manager. If you are a motivated and enthusiastic individual looking to gain hands-on experience in sales and business development, we encourage you to apply for this exciting internship opportunity at Webpulse Solution Private Limited. Join us in driving the growth of our company and making a positive impact in the digital marketing industry.",
    "skills": [
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Certificate",
      "Letter of recommendation",
      "5 days a week",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732916",
    "jobTitle": "Career Counsellor",
    "companyName": "Careers360",
    "location": "Gurgaon",
    "duration": "6 Months",
    "stipend": "₹ 20,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/career-counsellor-internship-in-gurgaon-at-careers3601742386236",
    "description": "About the Role: We are looking for enthusiastic and dedicated Career Counseling Interns to support our counseling initiatives during the admission season. This role offers a hands-on opportunity to guide students in making informed career choices and gain practical experience in counseling. Selected intern's day-to-day responsibilities include: 1. Assist in conducting one-on-one career counseling sessions with students. 2. Guide students on college selection, career pathways, and entrance exams. 3. Address queries related to courses, admission processes, and career prospects. 4. Support in organizing webinars, workshops, and online/offline student engagement activities. 5. Maintain records of counseling interactions and provide timely follow-ups. 6. Collaborate with senior counselors to enhance the counseling process. Requirements: 1. Recent graduate in Psychology or a related field (counseling experience is a plus). 2. Strong communication and interpersonal skills. 3. Passion for guiding and mentoring students. 4. Ability to work in a fast-paced environment and handle student queries effectively. 5. Proficiency in MS Office and basic online research skills. Benefits: 1. Hands-on experience in career counseling and student engagement. 2. Exposure to the EdTech and higher education sector. 3. Opportunity to work with experienced professionals in the field.",
    "skills": [
      "English Proficiency (Spoken)",
      "Certificate",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732001",
    "jobTitle": "Site Engineering",
    "companyName": "Cara Estates",
    "location": "Jaipur",
    "duration": "6 Months",
    "stipend": "₹ 7,000-8,500 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/site-engineering-internship-in-jaipur-at-cara-estates1742358228",
    "description": "Are you a motivated and detail-oriented individual looking to gain hands-on experience in site engineering? Look no further! Join Cara Estates as a Site Engineering intern and work with a dynamic team of professionals in the real estate industry. Selected intern's day-to-day responsibilities include: 1. Assist with site surveys and assessments to ensure compliance with regulations and standards. 2. Prepare and maintain accurate documentation and reports using MS Office applications. 3. Collaborate with engineers and project managers to support ongoing construction projects. 4. Utilize CAD software to create and update site plans and layouts. 5. Conduct research and analysis to support decision-making processes. 6. Participate in site visits and inspections to monitor progress and identify potential issues. 7. Learn and apply best practices in site engineering to contribute to the success of Cara Estates projects. If you are eager to learn, proactive, and have a strong work ethic, we want to hear from you! One-on-one mentorship and feedback from experienced professionals will given. Apply now and take the first step towards a rewarding career in site engineering with Cara Estates.",
    "skills": [
      "AutoCAD",
      "MS-Excel",
      "MS-Office",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732802",
    "jobTitle": "Influencer Marketing",
    "companyName": "Nippetals",
    "location": "Mumbai, Goa Velha",
    "duration": "3 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/influencer-marketing-internship-in-multiple-locations-at-nippetals1742380777",
    "description": "Selected intern's day-to-day responsibilities include: 1. Influencer Onboarding &amp; Outreach: Research, identify, and onboard influencers across Instagram, TikTok, and YouTube. 2. Relationship Management: Handle communication, gifting, contracts, and negotiation with influencers. 3. Campaign Execution: Ensure influencers follow content guidelines and deliver high-quality branded content. 4. Content Pipeline Management: Track, organize, and repurpose influencer-generated content for social media, website, and ads. 5. performance Tracking: Monitor engagement, reach, and ROI from influencer campaigns to optimize future collaborations. 6. Competitor &amp; Trend Analysis: Keep up with emerging influencer trends and new marketing strategies in the fashion and beauty space. What We're Looking For: 1. Passion for influencer marketing, fashion, and social media trends. 2. Strong organizational skills to manage multiple influencer partnerships at once. 3. Excellent communication and negotiation skills. 4. Data-driven mindset comfortable tracking performance and making decisions based on insights. 5. Bonus: Experience with influencer marketing platforms (Upfluence, Grin, or Shopify Creator tools). Why Join Us? 1. Work directly with the founders gain real experience in a fast-growing eCommerce brand. 2. Be at the forefront of influencer marketing help shape brand collaborations from scratch. 3. Flexibility &amp; Remote Work work from anywhere in India. 4. Fast growth opportunities high performers may get a full-time role.",
    "skills": [
      "Effective Communication",
      "English Proficiency (Written)",
      "Social Media Marketing",
      "Certificate",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732805",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Ella Advisory Services LLP",
    "location": "Gurgaon",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month +  Incentives",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-gurgaon-at-ella-advisory-services-llp1742380683",
    "description": "Selected intern's day-to-day responsibilities include: 1. To develop cold and lead-based conversions - calling and in-person meetings 2. To develop new strategies/initiatives for lead generation -B2B, B2C 3. To establish and maintain partner relationships for generating additional revenue 4. To participate in a partner planning process 5. Devise strategies to identify high-value leads and key potential partners and convert those into productive and profitable relationships",
    "skills": [
      "Client Relationship",
      "English Proficiency (Spoken)",
      "Marketing",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731741",
    "jobTitle": "Marketing",
    "companyName": "Nippetals",
    "location": "Mumbai, Goa Velha",
    "duration": "3 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/marketing-internship-in-multiple-locations-at-nippetals1742363759",
    "description": "Selected intern's day-to-day responsibilities include: 1. Data analysis &amp; insights: Track marketing performance, analyze trends and generate actionable insights. 2. Martech &amp; automation: Work with tools like GA4, Meta Ads, Klaviyo, and others to optimize campaigns. 3. UGC &amp; influencer marketing: Help manage influencer partnerships and analyze their impact. 4. Agency coordination: Be the link between our brand and external agencies to ensure smooth execution. 5. Creative collaboration: Work with designers and content creators to align data with storytelling. Why join us? 1. Direct mentorship: Work alongside the founders, not buried in a corporate hierarchy. 2. Full exposure: Gain experience across multiple marketing functions, not just one. 3. Impactful work: Your insights and ideas will shape real marketing strategies. 4. Future opportunities: High-performing interns will be considered for full-time roles. If you're a data-driven, Martech-loving problem solver who wants to work on exciting projects in a fast-growing brand, we'd love to hear from you!",
    "skills": [
      "Data Analysis",
      "Digital Marketing",
      "Certificate",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731650",
    "jobTitle": "Data Entry",
    "companyName": "Unnati Enterprises",
    "location": "Hyderabad",
    "duration": "1 Month",
    "stipend": "₹ 18,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/data-entry-internship-in-hyderabad-at-tamanna-sharma1742366999",
    "description": "We are looking for a detail-oriented Data Entry Executive to efficiently input, manage, and maintain accurate data records. The ideal candidate should have excellent typing skills, attention to detail, and the ability to work with large volumes of information. Selected intern's day-to-day responsibilities include: 1. Accurately enter, update, and maintain data in databases, spreadsheets, and company systems. 2. Verify and cross-check data for errors and inconsistencies. 3. Ensure timely processing of data and maintain confidentiality. 4. Retrieve and organize files as needed for reporting and record-keeping. 5. Perform quality checks to ensure data integrity and completeness.",
    "skills": [
      "English Proficiency (Spoken)",
      "MS-Office",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732467",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Sentriscope Data Intelligence Private Limited",
    "location": "Thane, Navi Mumbai, Mumbai, Virar, Borivali Tarf Rahur, Vasai-Virar",
    "duration": "3 Months",
    "stipend": "₹ 8,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-sentriscope-data-intelligence-private-limited1742368211",
    "description": "Selected intern's day-to-day responsibilities include: 1. Conduct cold and warm outreach (calls and emails) to generate new leads and expand the client base. 2. Schedule and conduct sales meetings to understand client needs and identify potential sales opportunities. 3. Consistently achieve daily, weekly, and monthly prospecting targets to maintain a strong sales pipeline. 4. Identify, understand, and match prospects' needs with our market research solutions. 5. Build and maintain strong professional relationships with clients and prospects through effective communication. 6. Utilize Microsoft Office and Google Workspace for task management, presentations, and report generation while maintaining accurate sales records.",
    "skills": [
      "Digital Marketing",
      "Email Marketing",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Lead Generation",
      "MS-Excel",
      "Sales",
      "Sales pitch",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731854",
    "jobTitle": "Brand Ambassador: Face Of The Company (Females Only)",
    "companyName": "Trivyams Digital Solutions",
    "location": "Tamilpadi, Tamil Nadu",
    "duration": "3 Months",
    "stipend": "₹ 5,000-22,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-brand-ambassador-face-of-the-company-females-only-internship-in-multiple-locations-at-trivyams-digital-solutions1742300744",
    "description": "Selected intern's day-to-day responsibilities include: 1. Act as the face of our company, representing the brand through video content. 2. Shoot self-recorded ad videos following the company-provided scripts. 3. Present brand messages confidently and engagingly as per company guidelines. 4. Collaborate with the team to ensure high-quality video content.",
    "skills": [
      "English Proficiency (Spoken)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732511",
    "jobTitle": "Project Management",
    "companyName": "FynTune Solution Private Limited",
    "location": "Thane, Navi Mumbai, Vashi, Belapur, Mumbai, Turbhe, Panvel",
    "duration": "6 Months",
    "stipend": "₹ 12,000-18,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/project-management-internship-in-multiple-locations-at-fyntune-solution-private-limited1742368097",
    "description": "Selected intern's day-to-day responsibilities include: 1. Work on project planning with stakeholders - FynTune internal team and clients for better clarity 2. Coordinate with different stakeholders (internal and external) for the smooth delivery of the overall project 3. Understand the requirements of clients and communicate well with the internal team for development and delivery 4. Analyze, evaluate, and troubleshoot gaps 5. Manage the overall project and client relationship",
    "skills": [
      "Effective Communication",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "MS-Word",
      "Product Lifecycle Management(PLM)",
      "Product Strategy",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2724030",
    "jobTitle": "Business Development (Sales)",
    "companyName": "StampMyVisa",
    "location": "Delhi, Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 10,000-12,000 /month",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-stampmyvisa1741598473",
    "description": "Selected intern's day-to-day responsibilities include: 1. Provide information and address client queries regarding upcoming &amp; ongoing Visa orders. 2. Educate clients on StampMyVisa's products and services to enhance their experience. 3. Coordinate effectively with internal stakeholders, including the Visa Expert Team and Finance Team. 4. Maintain and strengthen client relationships through calls and in-person meetings. 5. Handle escalations efficiently and ensure timely resolution.",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "Certificate",
      "Letter of recommendation",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732681",
    "jobTitle": "Data Analyst",
    "companyName": "Arcatron Mobility Private Limited",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 15,000-20,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/data-analyst-internship-in-pune-at-arcatron-mobility-private-limited1742376342",
    "description": "Selected intern's day-to-day responsibilities include: 1. Clean, and analyze the existing data to generate insights 2. Develop dashboards and reports using tools like Excel, SQL, Power BI, or Tableau 3. Support in creating data-driven recommendations for business improvement. 4. Work on automating data collection and reporting processes. 5. Collaborate with cross-functional teams to understand business needs and optimize data usage.",
    "skills": [
      "Data Analytics",
      "MS-Excel",
      "Power BI",
      "Python",
      "SQL",
      "Tableau",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731656",
    "jobTitle": "Acting",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "1 Month",
    "stipend": "₹ 25,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/acting-internship-in-lucknow-at-digital-heroes1742291392",
    "description": "Selected intern's day-to-day responsibilities include: 1. Creating YouTube case study videos 2. Participating in skits and shoots 3. Assisting with camera angles and communication",
    "skills": [
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Certificate",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731673",
    "jobTitle": "Technical Content Writer",
    "companyName": "Orufy Technologies Private Limited",
    "location": "Jaipur",
    "duration": "6 Months",
    "stipend": "₹ 10,000-15,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/technical-content-writer-internship-in-jaipur-at-orufy-technologies-private-limited1742294763",
    "description": "Selected intern's day-to-day responsibilities include: 1. Research industry-related topics to create well-structured content 2. Write engaging blog posts, articles, website content, social media captions, and email newsletters 3. Optimize content for SEO and readability 4. Assist in proofreading and editing content before publication 5. Collaborate with the marketing team to develop content strategies 6. Stay updated with industry trends and suggest creative content ideas",
    "skills": [
      "Creative Writing",
      "Effective Communication",
      "English Proficiency (Written)",
      "Research and Analytics",
      "Search Engine Optimization (SEO)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731067",
    "jobTitle": "Telecalling",
    "companyName": "Delkon Technologies",
    "location": "Bareilly",
    "duration": "6 Months",
    "stipend": "₹ 4,000 /month +  Incentives",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/telecalling-internship-in-bareilly-at-delkon-technologies1742274925",
    "description": "Selected intern's day-to-day responsibilities include: 1. Calling the client 2. Convincing the client 3. Meeting the monthly target",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731659",
    "jobTitle": "Graphic Design",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "3 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/graphic-design-internship-in-lucknow-at-digital-heroes1742291482",
    "description": "Selected intern's day-to-day responsibilities include: 1. Designing logos and product images 2. Editing some illustrations and creating some animations for the clients",
    "skills": [
      "Adobe Illustrator",
      "Adobe Photoshop",
      "CorelDRAW",
      "Certificate",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731652",
    "jobTitle": "Sales Consultant",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "1 Month",
    "stipend": "₹ 15,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/sales-consultant-internship-in-lucknow-at-digital-heroes1742291325",
    "description": "Selected intern's day-to-day responsibilities include: 1. Maintain client communications 2. Reach out to new leads and get them to convert with our secret method 3. Maintain good client relationships",
    "skills": [
      "Marketing",
      "Certificate",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731078",
    "jobTitle": "Graphic Design",
    "companyName": "Delkon Technologies",
    "location": "Bareilly",
    "duration": "6 Months",
    "stipend": "₹ 4,000 /month +  Incentives",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/graphic-design-internship-in-bareilly-at-delkon-technologies1742273608",
    "description": "We are seeking a talented and creative graphic design intern to join our team at Delkon Technologies. If you have a passion for design and a strong knowledge of CorelDRAW, Adobe Illustrator, Adobe Photoshop, video editing, and Adobe Premiere Pro, we want to hear from you! Selected intern's day-to-day responsibilities include: 1. Collaborate with the design team to create visually appealing graphics for various projects. 2. Assist in the development and execution of marketing materials, including flyers, brochures, and social media graphics. 3. Create engaging video content for promotional purposes using video editing software. 4. Ensure all designs are consistent with the brand identity and guidelines. 5. Stay up-to-date on industry trends and best practices in graphic design. 6. Take on additional design tasks and projects as needed. 7. Contribute fresh ideas and creativity to help elevate the company's visual presence. If you are a motivated and enthusiastic individual looking to gain valuable experience in graphic design, apply now to be part of our dynamic team at Delkon Technologies!",
    "skills": [
      "Adobe Illustrator",
      "Adobe Photoshop",
      "Adobe Premiere Pro",
      "CorelDRAW",
      "Video Editing",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731387",
    "jobTitle": "Customer Service/Customer Support",
    "companyName": "LEVELX MICRO SYSTEMES (OPC) PRIVATE LIMITED",
    "location": "Kochi, Mavelikkara",
    "duration": "3 Months",
    "stipend": "₹ 5,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/customer-service-customer-support-internship-in-multiple-locations-at-levelx-micro-systemes-opc-private-limited1742279397",
    "description": "As a Customer Service/Customer Support intern at LEVELX MICRO SYSTEMS (OPC) PRIVATE LIMITED, you will have the opportunity to enhance your communication skills and gain valuable experience in the technology industry. If you are fluent in both spoken and written English, this is the perfect opportunity for you to showcase your talents and make a positive impact on our customers. Key Responsibilities: 1. Provide exceptional customer service by addressing inquiries and resolving issues in a timely manner. 2. Assist customers with product information, troubleshooting, and technical support. 3. Monitor and respond to customer inquiries via email, phone, and chat. 4. Maintain accurate records of customer interactions and transactions. 5. Collaborate with internal teams to improve customer satisfaction and retention. 6. Identify trends and suggest solutions to enhance customer experience. 7. Participate in training sessions to develop your skills and knowledge in customer support. If you are a proactive and customer-focused individual looking to kickstart your career in customer service, apply now to join our dynamic team at LEVELX MICRO SYSTEMS (OPC) PRIVATE LIMITED!",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2725325",
    "jobTitle": "Social Media Marketing",
    "companyName": "Dhamma Setu Creative Technologies",
    "location": "Ghaziabad",
    "duration": "6 Months",
    "stipend": "₹ 7,000 /month",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/social-media-marketing-internship-in-ghaziabad-at-dhamma-setu-creative-technologies1741672149",
    "description": "Selected intern's day-to-day responsibilities include: 1. Manage and update social media pages for Manthan - The Churning of Mind across platforms (Instagram, YouTube, LinkedIn, Facebook, Twitter, etc.) and to manage the Instagram pages of Dhamma Setu Creative Technologies and manthan studio. 2. Create, schedule, and publish engaging content, including posts, stories, reels, videos, and graphics. 3. Collaborate with the founder to execute content ideas and ensure brand consistency. 4. Engage with the audience through comments, DMs, and community discussions to foster growth. 5. Monitor analytics and report insights to optimize content performance. Develop and implement creative campaigns to increase reach and engagement. Stay updated with social media trends, algorithms, and best practices.",
    "skills": [
      "Content Writing",
      "Creative Writing",
      "Digital Marketing",
      "English Proficiency (Written)",
      "Instagram Marketing",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731660",
    "jobTitle": "Content Writing",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "2 Months",
    "stipend": "₹ 20,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writing-internship-in-lucknow-at-digital-heroes1742294638",
    "description": "Selected intern's day-to-day responsibilities include: 1. Creating a YouTube case study videos 2. Participating in skits and shoots 3. Assisting with camera angles and communication",
    "skills": [
      "Social Media Marketing",
      "Certificate",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731700",
    "jobTitle": "Content Writing",
    "companyName": "Pinkcity Jobs",
    "location": "Jaipur",
    "duration": "3 Months",
    "stipend": "₹ 7,000-14,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writing-internship-in-jaipur-at-pinkcity-jobs1742297806",
    "description": "Selected intern's day-to-day responsibilities include: 1. Ensure readability to maintain intellectual depth 2. Create engaging writing with flow 3. Write blogs for various topics and niches 4. Write articles for service pages to enhance website content 5. Conduct thorough topic research and identify relevant content 6. Maintain perfect grammar and proper formatting 7. Produce original content with no AI usage and avoid plagiarism",
    "skills": [
      "Blogging",
      "Creative Writing",
      "Digital Marketing",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Search Engine Optimization (SEO)",
      "Certificate",
      "Letter of recommendation",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733195",
    "jobTitle": "Customer Service/Customer Support",
    "companyName": "WhataPortrait.com",
    "location": "Work from home",
    "duration": "4 Months",
    "stipend": "₹ 8,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-customer-service-customer-support-internship-at-whataportraitcom1742403226",
    "description": "Selected intern's day-to-day responsibilities include: 1. Responding promptly to customer inquiries via email and chat. 2. Reviewing and managing all client communications, inquiries, and orders to ensure high-quality service delivery. 3. Maintaining and strengthening existing customer relationships to ensure ongoing satisfaction and retention. 4. Liaising effectively with overseas customers to accommodate their requirements and time zones. 5. Collaborating with contracted artists and internal teams to ensure projects are completed accurately and on schedule. 6. Conducting thorough quality control and proofing of all completed projects before submission to clients for approval. 7. Working closely with the chat support team and the outbound call team to streamline client interactions and enhance service delivery. 8. Fostering a collaborative environment to facilitate seamless communication and efficient workflow within the team. 9. Compiling and analyzing monthly sales reports to track performance and identify improvement opportunities. 10. Providing insights and recommendations to senior management based on report findings.",
    "skills": [
      "English Proficiency (Written)",
      "Certificate",
      "Letter of recommendation",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731034",
    "jobTitle": "Accounting & Tally",
    "companyName": "Notion Press Media Private Limited",
    "location": "Chennai",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/accounting-tally-internship-in-chennai-at-dr-william-ebenezer1742281960",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in preparing financial statements and reports 2. Support the team in maintaining general ledger entries and accounts 3. Help with accounts payable and accounts receivable tasks 4. Assist in reconciling bank statements and processing payments 5. Participate in month-end and year-end closing processes 6. Support the team in budget preparation and financial analysis 7. Handle administrative tasks related to accounting functions 8. Assist with audit preparation and documentation",
    "skills": [
      "Accounting",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2729657",
    "jobTitle": "Accounting & Bookkeeping",
    "companyName": "Flybed Home",
    "location": "Mumbai, Goregaon Kh",
    "duration": "6 Months",
    "stipend": "₹ 5,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/accounting-bookkeeping-internship-in-multiple-locations-at-flybed-home1742206460",
    "description": "1) Accounts &amp; finance support: - Assist in maintaining accurate financial records, invoices, and receipts. - Support in processing vendor payments and tracking customer payments. - Assist in reconciling bank statements and identifying discrepancies. - Help in compiling necessary tax-related documents and ensuring compliance. - Work with Zoho Books for data entry, invoice generation, and reporting. 2) Administrative &amp; office management: - Support invoicing and vendor payment processing. - Assist in maintaining vendor relationships and documentation. - Maintain attendance, leave records, and salary processing support. - Handle documentation, data entry, and office organization tasks. - Support compliance with company policies and labor laws.",
    "skills": [
      "Accounting",
      "Taxation",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732005",
    "jobTitle": "Celebrity Management",
    "companyName": "Tring",
    "location": "Thane, Navi Mumbai, Mumbai, Panvel",
    "duration": "3 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/celebrity-management-internship-in-multiple-locations-at-tring1742358379",
    "description": "Selected intern's day-to-day responsibilities include: 1. Develop and execute brand strategies to ensure consistency across all marketing channels and touchpoints. 2. Maintain brand guidelines and ensure that brand messaging is effectively communicated across all marketing materials. 3. Identify and select appropriate celebrities or influencers to associate with the brand, ensuring their values align with the brand's image and target audience. 4. Negotiate contracts and manage relationships with celebrities, ensuring all contractual obligations are met. 5. Coordinate and oversee celebrity endorsement campaigns, photo shoots, events, and other promotional activities. 6. Identify and pursue potential brand partnerships and collaborations that align with the brand's values and marketing objectives. 7. Manage relationships with external agencies, vendors, and partners involved in brand and celebrity-related activities. Note: 1. Only male candidates can apply. 2. Prior experience in event coordination or celebrity management is required. 3. This is a full-time internship. Apply only if you can be in-office for the full time. No hybrid model is entertained.",
    "skills": [
      "Client Relationship",
      "Effective Communication",
      "Event Management",
      "Negotiation & Problem-solving",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732619",
    "jobTitle": "Creative Design",
    "companyName": "Art Of Puja",
    "location": "Delhi, Gurgaon, Noida",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/creative-design-internship-in-multiple-locations-at-art-of-puja1742371940",
    "description": "Selected intern's day-to-day responsibilities include: 1. Create visually appealing designs for product packaging that resonate with our brand ethos. 2.Develop social media creatives to drive engagement and connect with our audience. 3.Stay updated on design trends and bring fresh ideas to enhance our brand presence.",
    "skills": [
      "Adobe Photoshop",
      "Certificate",
      "Letter of recommendation",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731490",
    "jobTitle": "Human Resources (HR)",
    "companyName": "TopMentor",
    "location": "Pune",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/human-resources-hr-internship-in-pune-at-topmentor1742283201",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in the recruitment process by sourcing, screening, and shortlisting candidates for various positions 2. Schedule and coordinate interviews with potential candidates and hiring managers to ensure smooth scheduling 3. Maintain and update candidate databases and manage applicant tracking systems efficiently 4. Assist with onboarding of new hires and ensure all necessary documentation is completed accurately 5. Handle day-to-day HR operations, including addressing employee queries, managing documents, and coordinating with different departments 6. Support the HR team in implementing policies, procedures, and employee engagement initiatives effectively 7. Assist in organizing training and development programs to enhance employee skills 8. Ensure compliance with company policies and procedures to maintain standards 9. Maintain records related to employee performance, attendance, and other HR metrics to track employee progress",
    "skills": [
      "Effective Communication",
      "Interpersonal Skills",
      "MS-Excel",
      "MS-Office",
      "MS-Word",
      "Recruitment",
      "Certificate",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732323",
    "jobTitle": "Accounting",
    "companyName": "Dev Jewels",
    "location": "Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 10,000-18,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/accounting-internship-in-mumbai-at-dev-jewels1742359377",
    "description": "1. Minimum of 2+ years of relevant professional experience and must be an accountant 2. Technically strong with solid knowledge in Indian Accounting Standards (IGAAP) and international~ Financial Reporting Standards (IFRS) 3. Technically strong with basic knowledge in direct and indirect tax compliance 4. Technically strong with solid knowledge in import and export tax 5. Service-oriented and conscientious with attention to detail 6. Outgoing personality with excellent verbal &amp; written English communication skills, and commitment to achieving results",
    "skills": [
      "English Proficiency (Written)",
      "MS-Excel",
      "MS-Office",
      "Tally",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731658",
    "jobTitle": "Digital Marketing",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "1 Month",
    "stipend": "₹ 12,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/digital-marketing-internship-in-lucknow-at-digital-heroes1742291456",
    "description": "Selected intern's day-to-day responsibilities include: 1. Work on SEO and SMO to improve website performance 2. Check on the company website on Shopify, and help with other IT related stuff 3. Customize and design websites on a daily basis (3-4 hours of work daily) 4. Run Google, Facebook, Snapchat, Tiktok ads on daily basis for clients",
    "skills": [
      "Facebook Ads",
      "Google AdWords",
      "Social Media Marketing",
      "YouTube Ads",
      "Certificate",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732661",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Bibli Innovations Pvt Ltd",
    "location": "Bangalore, Delhi",
    "duration": "1 Month",
    "stipend": "₹ 20,000-25,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-bibli-innovations-pvt-ltd1742376280",
    "description": "Selected intern's day-to-day responsibilities include: 1. Identify &amp; Connect with Colleges - 6 to 8 per day. 2. Meet key stakeholders and present company offerings 3. Schedule demo sessions for students. 4. Follow up with colleges 5. Provide updates to the team Additional Responsibilities: 1. Lead Generation 2. Relationship Management 3. Partnerships &amp; Program Promotion",
    "skills": [
      "English Proficiency (Spoken)",
      "Interpersonal Skills",
      "Sales"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732464",
    "jobTitle": "Finance & Accounting",
    "companyName": "Fraterniti Foods Private Limited",
    "location": "Gurgaon",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/finance-accounting-internship-in-gurgaon-at-fraterniti-foods-private-limited1742368166",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in preparing financial reports, statements, and spreadsheets. 2. Support budgeting and forecasting activities. 3. Reconcile financial transactions and maintain accurate records. 4. Analyze financial data and create reports for management review. 5. Assist in invoice processing, expense tracking, and account reconciliation. 6. Research financial trends and prepare summaries. 7. Ensure compliance with company financial policies and procedures. 8. Work with various departments to streamline financial processes.",
    "skills": [
      "Accounting",
      "Tally",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732523",
    "jobTitle": "Brand Marketing",
    "companyName": "Teach Maven",
    "location": "Chennai, Coimbatore, Madurai, Mangalore, Mysuru, Visakhapatnam, Bangalore, Hyderabad, Kochi, Vijayawada",
    "duration": "6 Months",
    "stipend": "₹ 11,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/brand-marketing-internship-in-multiple-locations-at-teach-maven1742370386",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in the identification and qualification of leads using various tools and platforms, including social media, LinkedIn, email campaigns, and other digital channels. 2. Maintain and update the lead database by ensuring that all lead information is captured accurately and effectively within CRM tools. 3. Conduct research to identify trends, potential markets, and competitor activities in the EdTech industry. 4. Collaborate with the content team to create and distribute engaging content that attracts leads (blogs, emails, social media posts). 5. Assist in the creation and execution of email campaigns and follow-up sequences to nurture leads. 6. Monitor and report on the effectiveness of lead generation efforts, including conversion rates, campaign ROI, and key performance metrics. 7. Work closely with sales, marketing, and product teams to align on lead quality, campaign strategies, and messaging.",
    "skills": [
      "Effective Communication",
      "Email Marketing",
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Lead Generation",
      "Certificate",
      "Flexible work hours",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731696",
    "jobTitle": "Startup Strategy & Execution (Founder’s Office)",
    "companyName": "Special Situation Advisors India Private Limited",
    "location": "Thane, Navi Mumbai, Dombivli, Kalyan, Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 15,000-20,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/startup-strategy-execution-founders-office-internship-in-multiple-locations-at-special-situation-advisors-india-private-limited1742298338",
    "description": "Selected intern's day-to-day responsibilities include: 1. Learn how a startup works: Get hands-on experience in strategy, product development, operations, and marketing by working on real business challenges. 2. Work closely with leadership: Collaborate directly with the MD &amp; senior team, gaining mentorship, insights, and business wisdom most people take years to learn. 3. Market research &amp; industry analysis: Conduct data-driven research on the competitive landscape, trends, and new opportunities. 4. Execute projects: Help plan, manage, and complete key tasks of every project that contribute to the execution of real startup growth. 5. Work with different teams: Collaborate across multiple functions (strategy, product, sales &amp; marketing), ensuring teamwork efficiency, and strategic and seamless execution. 6. Develop an entrepreneurial mindset: Learn to prioritize tasks, manage deadlines, take ownership, and report the same to the management at regular intervals. 7. Solve real problems: Identify challenges, think critically, and find smart solutions- just like a startup leader would. 8. Strategic partnerships &amp; growth: Assist in business development, lead generation, and partnership execution. 9. Make an impact from day one: This isn't just an internship- it's your foundation for building a successful startup in the future.",
    "skills": [
      "Canva",
      "Effective Communication",
      "MS-Excel",
      "MS-PowerPoint",
      "MS-Word",
      "Problem Solving",
      "Research and Analytics",
      "Time Management",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2727188",
    "jobTitle": "Cinematography",
    "companyName": "8Views",
    "location": "Secunderabad, Hyderabad, Madhapur, Telangana",
    "duration": "6 Months",
    "stipend": "₹ 8,000-12,000 /month",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/cinematography-internship-in-multiple-locations-at-8views1741697003",
    "description": "As a Cinematographer Intern at 8 Views, you will collaborate closely with our video production team, assisting in various aspects of filming, lighting, and equipment management. This internship offers hands-on experience in cinematography, focusing on creating video content for advertisements and posts in industries like healthcare, education, and real estate, intended for social media platforms. Selected intern's day-to-day responsibilities include: 1. Assist in setting up and maintaining lighting and camera equipment for shoots. 2. Support the cinematography team in framing, shot composition, and camera movements. 3. Work closely with the Senior Cinematographer to execute creative visual storytelling. 4. Help organize and manage equipment inventory. 5. Participate in pre-production activities, including location scouting and shot planning. 6. Collaborate with the team to brainstorm and develop visually compelling content. 7. Maintain a professional and creative approach to cinematography while adhering to brand guidelines.",
    "skills": [
      "Photography",
      "Video Editing",
      "Video Making",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731225",
    "jobTitle": "Social Media Marketing",
    "companyName": "Farmdidi",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/social-media-marketing-internship-in-pune-at-farmdidi1742272632",
    "description": "Selected intern's day-to-day responsibilities include: 1. Develop and produce high-quality video content for various social media platforms (e.g., Instagram, Facebook, YouTube) 2. Brainstorm and conceptualize video ideas that align with our brand and target audience 3. Write scripts, storyboards, and film video content 4. Edit and conduct post-production of videos, including audio mixing, color correction, and adding visual effects 5. Collaborate with the marketing team to ensure consistency with brand guidelines and messaging 6. Stay up-to-date with the latest trends and best practices in social media video production 7. Analyze video performance metrics and make recommendations for improvements",
    "skills": [
      "Creative Writing",
      "English Proficiency (Spoken)",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2717209",
    "jobTitle": "Performance Marketing (Paid Ads)",
    "companyName": "8Views",
    "location": "Secunderabad, Hyderabad, Madhapur, Telangana",
    "duration": "3 Months",
    "stipend": "₹ 10,000-15,000 /month",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/performance-marketing-paid-ads-internship-in-multiple-locations-at-8views1740650072",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in the setup, execution, and optimization of paid media campaigns across platforms like Google Ads, Facebook Ads, Instagram Ads, LinkedIn Ads, and other channels 2. Monitor and analyze the performance of campaigns, including tracking metrics like CTR, CPC, CPA, ROAS, and conversion rates, and provide insights and recommendations for optimization 3. Conduct keyword research for search engine marketing campaigns and provide insights into keyword performance 4. Assist in preparing weekly and monthly performance reports, summarizing campaign results, and presenting insights to the team 5. Collaborate with the design team to ensure that ad creatives are aligned with brand guidelines and optimized for performance 6. Conduct competitive analysis and keep track of digital marketing trends to identify new opportunities for performance marketing growth 7. Assist in optimizing landing pages for better user experience and conversion rates",
    "skills": [
      "Digital Advertising",
      "Digital Marketing",
      "Facebook Ads",
      "Google AdWords",
      "Google Analytics",
      "Instagram Marketing",
      "Search Engine Marketing (SEM)",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730388",
    "jobTitle": "Lead Generation",
    "companyName": "Heterize Infotech Private Limited",
    "location": "Indore",
    "duration": "4 Months",
    "stipend": "₹ 7,000 /month +  Incentives",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/lead-generation-internship-in-indore-at-heterize-infotech-private-limited1742195674",
    "description": "Selected intern's day-to-day responsibilities include: 1. Conduct research to identify potential leads and target markets 2. Generate and qualify leads through cold calling, email campaigns, and other innovative strategies to create a robust pipeline for the sales team 3. Collaborate closely with the sales team to develop effective lead nurturing and conversion strategies, ensuring a smooth handover of qualified leads",
    "skills": [
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "MS-Excel",
      "Sales",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2714784",
    "jobTitle": "Search Engine Optimization (SEO)",
    "companyName": "8Views",
    "location": "Secunderabad, Hyderabad, Madhapur, Telangana",
    "duration": "3 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/search-engine-optimization-seo-internship-in-multiple-locations-at-8views1740400663",
    "description": "Selected intern's day-to-day responsibilities include: 1. Conduct keyword research and analysis to identify opportunities for optimizing content. 2. Assist in developing and implementing SEO strategies to improve organic search rankings. 3. Optimize website content, including meta tags, titles, descriptions, and on-page elements. 4. Collaborate with the content team to ensure SEO best practices are integrated into all content. 5. Monitor and report on website performance using SEO tools and analytics platforms. 6. Stay up-to-date with the latest trends and changes in SEO and digital marketing. 7. Support link-building efforts by identifying and reaching out to potential partners.",
    "skills": [
      "Digital Marketing",
      "Google Analytics",
      "Search Engine Marketing (SEM)",
      "Search Engine Optimization (SEO)",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2729690",
    "jobTitle": "Sales",
    "companyName": "Brained.app",
    "location": "Mumbai",
    "duration": "2 Months",
    "stipend": "₹ 8,000-10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/sales-internship-in-mumbai-at-brainedapp1742302515",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in identifying and qualifying potential leads through research and outreach (email, LinkedIn, etc.). 2. Support the sales team in scheduling meetings, demos, and follow-up communications with prospects. 3. Participate in crafting and delivering sales presentations and pitches tailored to potential clients' needs. 4. Conduct market research to identify industry trends and potential target markets. 5. Help maintain and update CRM systems with accurate lead and client information. 6. Collaborate with the marketing team to align sales and marketing strategies for lead nurturing. 7. Assist with preparing sales collateral and proposals for potential clients. 8. Analyze sales data to provide insights and recommendations for improving sales strategies.",
    "skills": [
      "English Proficiency (Spoken)",
      "Lead Generation",
      "Sales pitch",
      "Certificate",
      "Letter of recommendation",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730383",
    "jobTitle": "E-Commerce Catalog Management",
    "companyName": "Heterize Infotech Private Limited",
    "location": "Indore",
    "duration": "3 Months",
    "stipend": "₹ 5,000-8,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/e-commerce-catalog-management-internship-in-indore-at-heterize-infotech-private-limited1742195516",
    "description": "Selected intern's day-to-day responsibilities include: 1. Creating product catalogs for online e-commerce platforms, adding product information, including descriptions, images, and specifications 2. Updating and maintaining product catalogs on e-commerce platforms, adding new products,removing discontinued items, and managing inventory and stock availability 3. Creating and managing product listing files for bulk uploads 4. Formating data in accordance with platform requirements 5. Including key product attributes such as SKU, price, quantity, and variations 6. Optimizing product titles and descriptions 7. Verifying and troubleshooting listing errors or issues",
    "skills": [
      "MS-Excel",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2717193",
    "jobTitle": "Copywriting",
    "companyName": "8Views",
    "location": "Secunderabad, Hyderabad, Madhapur, Telangana",
    "duration": "3 Months",
    "stipend": "₹ 8,000-15,000 /month",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/copywriting-internship-in-multiple-locations-at-8views1740646913",
    "description": "Selected intern's day-to-day responsibilities include: 1. Create engaging and SEO-friendly content for various digital platforms, including blogs and social media 2. Collaborate with the team to align content with brand voice and marketing objectives 3. Contribute to social media content calendars and assist in drafting posts for increased engagement 4. Gain hands-on experience in editing content for clarity, grammar, and adherence to brand guidelines 5. Conduct research on industry trends, competitor content, and audience preferences 6. Work closely with the design team to create visually appealing content and learn basic graphic elements 7. Assist in creating email marketing content, newsletters, and promotional materials",
    "skills": [
      "Content Writing",
      "Copywriting",
      "Creative Writing",
      "Digital Marketing",
      "English Proficiency (Written)",
      "Search Engine Optimization (SEO)",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730384",
    "jobTitle": "E-commerce Operations",
    "companyName": "Heterize Infotech Private Limited",
    "location": "Indore",
    "duration": "3 Months",
    "stipend": "₹ 2,000-5,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-e-commerce-operations-internship-in-indore-at-heterize-infotech-private-limited1742195566",
    "description": "Selected intern's day-to-day responsibilities include: 1. Collaborate with the team to streamline operational processes and enhance overall efficiency 2. Assist in catalog management, ensuring accurate product listings, descriptions, and images across various platforms 3. Conduct data analysis using MS-Excel to generate meaningful insights and reports for decision-making 4. Support inventory management by monitoring stock levels, coordinating with suppliers, and resolving any discrepancies 5. Aid in order processing, fulfillment, and shipping, ensuring prompt delivery and customer satisfaction 6. Assist in Seller support activities, responding to inquiries, resolving issues, and maintaining a positive brand image",
    "skills": [
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "MS-Excel",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2714777",
    "jobTitle": "Content Writing",
    "companyName": "8Views",
    "location": "Secunderabad, Hyderabad, Madhapur, Telangana",
    "duration": "3 Months",
    "stipend": "₹ 8,000-15,000 /month",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writing-internship-in-multiple-locations-at-8views1740400258",
    "description": "Selected intern's day-to-day responsibilities include: 1. Develop engaging, SEO-friendly content for digital platforms, including blogs and social media. 2. Collaborate with the team to ensure content aligns with the brand voice and marketing goals. 3. Assist in managing social media content calendars and drafting posts to enhance audience engagement. 4. Gain practical experience in content editing, focusing on clarity, grammar, and brand consistency. 5. Conduct research on industry trends, competitor strategies, and audience preferences to improve content quality. 6. Support the creation of email marketing campaigns, newsletters, and promotional materials.",
    "skills": [
      "Blogging",
      "Content Marketing",
      "Content Writing",
      "Creative Writing",
      "Digital Advertising",
      "Digital Marketing",
      "Search Engine Optimization (SEO)",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731397",
    "jobTitle": "Motion Graphics & 3D Designer",
    "companyName": "Ace 360",
    "location": "Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/motion-graphics-3d-designer-internship-in-mumbai-at-ace-3601742282678",
    "description": "We are seeking a creative and detail-oriented motion graphics &amp; 3D designer to support our digital marketing initiatives. The ideal candidate should be proficient in Adobe After Effects, Premiere Pro, and Blender, with the ability to create visually engaging motion graphics, visual effects, and 3D content tailored for digital campaigns, social media, and online platforms. Selected intern's day-to-day responsibilities include: 1. Develop motion graphics and animations for digital marketing content 2. Create 3D visuals and animations using Blender for product and brand presentations 3. Enhance visual assets with Premiere Pro for use across digital channels 4. Collaborate with the marketing team to deliver creative assets aligned with campaign goals 5. Ensure consistency in design and maintain brand guidelines",
    "skills": [
      "Adobe After Effects",
      "Adobe Illustrator",
      "Adobe Photoshop",
      "Adobe Premiere Pro",
      "Blender 3D",
      "Canva",
      "Figma",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730269",
    "jobTitle": "Social Media Marketing",
    "companyName": "Tacheon",
    "location": "Chennai",
    "duration": "2 Months",
    "stipend": "₹ 8,000-12,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/social-media-marketing-internship-in-chennai-at-tacheon1742272347",
    "description": "Role Overview: 1. You will own our social media strategy and execution across Instagram and YouTube. 2. You will focus on video content, driving follower growth, and creating engaging experiences. 3. You will leverage AI tools to streamline production and scale content rapidly. Selected intern's day-to-day responsibilities include: 1. Social Strategy &amp; Growth: Develop and implement plans to increase our social following, reach, and engagement on Instagram and YouTube. 2. Video Creation &amp; Editing: Produce compelling short-form videos (Reels, Shorts) and longer YouTube content. Use AI tools to accelerate output without compromising quality. 3. Content Calendar &amp; Planning: Maintain a schedule of content topics, shoot plans, and posting timelines to ensure consistency. 4. Performance Analysis: Track metrics, analyze audience insights and refine tactics to maximize engagement and growth. 5. Collaboration: Work closely with the Content Lead and other teams to align social content with broader brand messaging. 6. Trend Spotting: Stay on top of emerging social trends, features, and AI-driven video creation techniques.",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Instagram Marketing",
      "Video Editing",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731167",
    "jobTitle": "Human Resources (HR)",
    "companyName": "Hamsi Marketing Private Limited",
    "location": "Hyderabad",
    "duration": "4 Months",
    "stipend": "₹ 2,000-6,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/human-resources-hr-internship-in-hyderabad-at-hamsi-marketing-private-limited1742258403",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist with recruitment and onboarding processes, including posting job openings, screening resumes, and conducting interviews 2. Support our employee engagement initiatives by organizing team-building activities, recognition programs, and employee surveys 3. Assist in developing and implementing HR policies and procedures, ensuring compliance with employment laws and regulations 4. Help with maintaining employee records and data, including attendance, leave, and performance evaluations 5. Contribute to employee development and training programs by coordinating workshops, seminars, and online learning platforms 6. Support HR projects, such as performance management, talent acquisition, and diversity and inclusion initiatives 7. Provide administrative support to the HR team, including scheduling meetings, preparing reports, and managing HR documents If you are a proactive and motivated individual with a passion for HR, we want to hear from you! Join us as an HR intern and embark on a rewarding journey to enhance your skills and make a positive impact on our organization. Apply now and let's grow together!",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "MS-Office",
      "MS-Word",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731287",
    "jobTitle": "Fashion Design And Merchandising",
    "companyName": "Colors Of India",
    "location": "Navi Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/fashion-design-and-merchandising-internship-in-navi-mumbai-at-colors-of-india1742278800",
    "description": "Selected intern's day-to-day responsibilities include coordinating with seniors in the office including workshops and helping them in their fashion-related works",
    "skills": [
      "Adobe Photoshop",
      "CorelDRAW",
      "Photography"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730648",
    "jobTitle": "Key Relationship Management Trainee",
    "companyName": "Special Situation Advisors India Private Limited",
    "location": "Thane, Navi Mumbai, Dombivli, Kalyan, Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 7,000-10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/key-relationship-management-trainee-internship-in-multiple-locations-at-special-situation-advisors-india-private-limited1742283528",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in identifying and reaching out to institutional clients, particularly banks and NBFCs, to establish new business relationships 2. Monitor industry trends, regulatory changes, and distressed asset market developments to provide actionable insights 3. Build professional connections with key stakeholders, set up meetings, and facilitate interactions between lenders and investors 4. Support senior colleagues in pitching distressed asset solutions to bank personnel and NBFC executives 5. Assist in crafting NPL (non-performing loan) resolution proposals, prepare data for lender meetings, and support due diligence processes 6. Track distressed asset transactions, maintain industry databases, and generate reports to aid decision-making",
    "skills": [
      "Effective Communication",
      "Market Analysis",
      "MS-Excel",
      "MS-PowerPoint",
      "Research and Analytics",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2717336",
    "jobTitle": "Business Development (Sales)",
    "companyName": "IMax Technologies Private Limited",
    "location": "Delhi",
    "duration": "6 Months",
    "stipend": "₹ 5,000 /month +  Incentives",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-delhi-at-imax-technologies-private-limited1740661275",
    "description": "Selected intern's day-to-day responsibilities include: 1. Conducting market research to identify potential channel partners and understand market trends. 2. Assisting in reaching out to potential partners through emails, calls, and social media. 3. Supporting the management of relationships with existing channel partners, ensuring effective communication and collaboration. 4. Assisting the sales team by preparing presentations, proposals, and reports related to channel partner performance. 5. Analyzing sales data and partner performance metrics to provide insights for strategy development. 6. Helping organize events or webinars aimed at engaging channel partners and promoting products or services. 7. Maintaining accurate records of partner interactions, agreements, and performance metrics.",
    "skills": [
      "Effective Communication",
      "Interpersonal Skills",
      "Time Management",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731778",
    "jobTitle": "B2B Sales",
    "companyName": "Visible Gain",
    "location": "Noida",
    "duration": "6 Months",
    "stipend": "₹ 10,000-15,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/b2b-sales-internship-in-noida-at-visible-gain1742298733",
    "description": "We are looking for a dynamic B2B sales intern to join our team at Visible Gain! As an English-speaking intern, you will have the opportunity to hone your skills in sales, marketing, and communication while working with a talented group of professionals. Selected intern's day-to-day responsibilities include: 1. Developing and delivering compelling sales pitches to potential clients. 2. Generating leads through various channels and networking opportunities. 3. Using effective communication skills to build and maintain relationships with clients. 4. Utilizing MS Excel to track and analyze sales data for optimization. 5. Collaborating with the sales and marketing teams to brainstorm new strategies. 6. Participating in client meetings and presentations to showcase our products and services. 7. Assisting in the creation of sales materials and promotional campaigns. If you are a motivated individual with a passion for sales and a desire to learn and grow in a fast-paced environment, then we want to hear from you! Join us at Visible Gain and take the first step towards a successful career in B2B sales!",
    "skills": [
      "Effective Communication",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Lead Generation",
      "Marketing",
      "MS-Excel",
      "Sales",
      "Sales pitch"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731994",
    "jobTitle": "Psychology",
    "companyName": "Autism Play",
    "location": "Pune, Pimpri-Chinchwad, Pashane, Punewadi, Shivaji Nagar",
    "duration": "6 Months",
    "stipend": "₹ 8,000-12,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-psychology-internship-in-multiple-locations-at-autism-play1742302817",
    "description": "Selected intern's day-to-day responsibilities include: 1. 2 hours play therapy with child to help them to improve in all areas of learning, development, communication and skill acquisition. 2. Conducting initial assessments to understand child's strengths, challenges, interests, and sensory sensitivities. 3. Designing a safe, structured, and sensory-friendly therapy space that promotes engagement and reduces anxiety. 4. Establishing a trusting and supportive relationship with each child through attuned interactions, active listening, and sensitivity to individual preferences and communication styles. 5. Implementing evidence-based play therapy techniques such as Floortime/DIR (Developmental, Individual-differences, Relationship-based model) and sensory integration activities. 6. Using imaginative play, role-playing, creative arts, and sensory experiences to address social communication deficits, emotional expression, and problem-solving skills. 7. Continuously evaluating the effectiveness of interventions through ongoing observation, data collection, and progress monitoring. We are looking for sincere, enthusiastic young people to be a part of our program to continue helping a child to stretch and grow their love to be with friends. If you are keen to learn a niche program and are passionate about working with special children then we would LOVE to have you join our team and family. Commitment: 2 hours per day for 6 months, no prior experience is required.",
    "skills": [
      "English Proficiency (Spoken)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2727396",
    "jobTitle": "Business Development (Sales)",
    "companyName": "The Education Match",
    "location": "Thane, Navi Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 7,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-business-development-sales-internship-in-multiple-locations-at-the-education-match1741851650",
    "description": "Selected intern's day-to-day responsibilities include: 1. Manage the station at The Education Match kiosks in major malls across Thane and Navi Mumbai 2. Engage with parents and students, explaining how The Education Match can assist in career and educational planning 3. Generate leads by identifying students who would benefit from our platform 4. Maintain accurate records of interactions, leads, and feedback collected at the kiosk 5. Collaborate with the business development team to improve engagement strategies",
    "skills": [
      "Effective Communication",
      "English Proficiency (Spoken)",
      "Sales pitch",
      "Certificate",
      "Letter of recommendation",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2722543",
    "jobTitle": "Civil Engineering",
    "companyName": "Ananathapuramu Hindupur Urban Development Authority (AHUDA)",
    "location": "Anantapur",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/civil-engineering-internship-in-anantapur-at-ananathapuramu-hindupur-urban-development-authority-ahuda1741350602",
    "description": "Selected intern's day-to-day responsibilities include: 1. Preparation of detailed project reports for projects proposed by AHUDA. 2. Supervise the infrastructural developments in AHUDA-approved layouts. 3. Preparation of estimates for the developmental works proposed by AHUDA. 4. To conduct regular inspections of the developmental works taken up by AHUDA and to verify adherence to the approved designs and standards.",
    "skills": [
      "AutoCAD",
      "MS-Office"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730975",
    "jobTitle": "Video Editing/Making",
    "companyName": "NextEdge Labs",
    "location": "Thane, Navi Mumbai, Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 5,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/video-editing-making-internship-in-multiple-locations-at-nextedge-labs1742221016",
    "description": "NextEdge Labs is seeking a talented and dynamic Video Editor to join our creative team. If you have a passion for storytelling and possess exceptional skills in Adobe Premiere Pro, Adobe After Effects, video making, video editing, Adobe Illustrator, and Adobe Photoshop, then this is the perfect opportunity for you! Selected intern's day-to-day responsibilities include: 1. Collaborate with the content team to understand project objectives and develop creative video concepts that align with our brand vision 2. Edit and assemble raw footage into polished videos that are visually stunning and engaging, ensuring seamless transitions, audio synchronization, and captivating storytelling 3. Utilize Adobe Premiere Pro and Adobe After Effects to create visually appealing motion graphics, visual effects, and animations that enhance the overall video quality 4. Take ownership of the entire video editing process, from conceptualization to final delivery, ensuring that all projects are completed within the given timeframe 5. Help in the development of video concepts and storyboards, ensuring that they align with our brand guidelines and effectively communicate our message 6. Collaborate with the marketing team to create engaging video content for various platforms, including social media, websites, and promotional materials 7. Stay up-to-date with the latest video editing trends and technologies, continuously improving your skills and exploring innovative techniques to enhance our video production capabilities Join our team at NextEdge Labs and unleash your creativity to elevate our brand to new heights! (Note- this position demands a hybrid model. Hence people nearby thane are only requested to apply for this internship.)",
    "skills": [
      "Adobe After Effects",
      "Adobe Premiere Pro",
      "Video Editing",
      "Video Making",
      "Certificate",
      "Letter of recommendation",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733031",
    "jobTitle": "MIS Executive",
    "companyName": "MN Fashions",
    "location": "Jaipur",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/mis-executive-internship-in-jaipur-at-mn-fashions1742387757",
    "description": "Are you ready to kickstart your career in the world of fashion and technology? MN Fashions is looking for a dynamic MIS Executive intern to join our team. If you have a strong understanding of MS-Excel and MS-Office, this could be the perfect opportunity for you to gain valuable experience and build your skills in a fast-paced environment. Selected intern's day-to-day responsibilities include: 1. Analyzing and interpreting data to provide insights for decision-making 2. Creating reports and presentations for management meetings 3. Assisting in the development and implementation of MIS systems 4. Supporting the team in system upgrades and troubleshooting 5. Collaborating with cross-functional teams to ensure data accuracy and integrity 6. Conducting training sessions for employees on software applications 7. Assisting in special projects and initiatives to improve operational efficiency Join us at MN Fashions and make a difference in the fashion industry while honing your MIS skills! Apply now to be part of our innovative team.",
    "skills": [
      "MS-Excel",
      "MS-Office"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732994",
    "jobTitle": "Personal Assistant",
    "companyName": "MN Fashions",
    "location": "Jaipur",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/personal-assistant-internship-in-jaipur-at-mn-fashions1742387562",
    "description": "Are you a go-getter with a passion for fashion? MN Fashions is seeking a motivated Personal Assistant intern who is proficient in MS-Excel to join our dynamic team. As a key support member, you will have the opportunity to learn and grow in a fast-paced environment while assisting with various administrative tasks and projects. Selected intern's day-to-day responsibilities include: 1. Manage calendars and schedule appointments 2. Prepare reports and presentations using MS-Excel 3. Assist with organizing meetings and events 4. Handle correspondence and communication with clients 5. Coordinate travel arrangements and accommodations 6. Maintain confidential information and files 7. Provide general administrative support to the team If you are detail-oriented, organized, and eager to gain hands-on experience in the fashion industry, this internship is perfect for you! Join us at MN Fashions and take the first step towards a successful career as a Personal Assistant. Apply now and be part of our exciting journey!",
    "skills": [
      "MS-Excel",
      "MS-Office",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733090",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Minus Equals Plus",
    "location": "Mapusa, Penha De França, Bardez",
    "duration": "3 Months",
    "stipend": "₹ 5,000 /month +  Incentives",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-minus-equals-plus1742390485",
    "description": "Selected intern's day-to-day responsibilities include: 1. Build contacts with potential clients to create new business opportunities 2. Keep prospective client database updated 3. Make cold calls for new business leads 4. Provide support in writing new business proposals 5. Maintain knowledge of all product and service offerings of the company 6. Arrange meetings for senior management with prospective clients 7. Follow company guidelines and procedures for the acquisition of customers",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Konkani Proficiency (Spoken)",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730552",
    "jobTitle": "Digital Marketing",
    "companyName": "Twoepic Ventures",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 8,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/digital-marketing-internship-in-pune-at-twoepic-ventures1742211900",
    "description": "Selected intern's day-to-day responsibilities include: 1. Managing marketing clients over chats (specifically regarding meta ads) 2. Solving customer queries regarding meta ads",
    "skills": [
      "Digital Marketing",
      "Facebook Ads",
      "Search Engine Optimization (SEO)",
      "Social Media Marketing",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731472",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Nexcel Consultancy Private Limited",
    "location": "Dombivli",
    "duration": "3 Months",
    "stipend": "₹ 8,000-20,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-dombivli-at-nexcel-consultancy-private-limited1742282499",
    "description": "Selected intern's day-to-day responsibilities include: 1. Managing and coordinating social media branding activities 2. Handling initial responses to online inquiries and transferring qualified leads to the operations team 3. Empaneling and maintaining firm listings on relevant platforms 4. Drafting proposals, quotations, and pitch decks for client presentations 5. Maintaining and updating CRM for client interactions 6. Coordinating client invoicing and following up on receivables 7. Assisting in business development initiatives",
    "skills": [
      "Digital Marketing",
      "Effective Communication",
      "Email Marketing",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "LinkedIn Marketing",
      "MS-Excel",
      "Sales pitch",
      "Social Media Marketing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2729998",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Pitambra Film & Production LLP",
    "location": "Ahmedabad",
    "duration": "2 Months",
    "stipend": "₹ 15,000-20,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-ahmedabad-at-pitambra-film-production-llp1742126655",
    "description": "Are you a go-getter with a passion for sales and business development? Look no further! Pitambra Film &amp; Production LLP is seeking a dynamic Business Development (Sales) intern to join our team. As an intern, you will have the opportunity to work closely with our sales team to help drive growth and expand our client base. Key responsibilities: 1. Conduct market research to identify potential clients and opportunities for growth. 2. Assist in creating and implementing sales strategies to reach target goals. 3. Collaborate with team members to generate leads and follow up on sales inquiries. 4. Utilize MS-Excel to track sales progress and analyze data for strategic decision making. 5. Participate in client meetings and presentations to showcase our services and offerings. 6. Support the sales team in developing proposals and negotiating contracts. 7. Maintain relationships with existing clients and provide exceptional customer service. If you are a motivated individual with excellent English proficiency and a strong grasp of MS-Excel, we want to hear from you! Join us and gain valuable hands-on experience in the exciting world of film and production sales. Apply now and kickstart your career in business development!",
    "skills": [
      "English Proficiency (Spoken)",
      "MS-Excel",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732604",
    "jobTitle": "Customer Service",
    "companyName": "International Institute Of Data Science & Technology",
    "location": "Noida",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/customer-service-internship-in-noida-at-international-institute-of-data-science-technology1742380526",
    "description": "Selected intern's day-to-day responsibilities include: 1. Respond to customer queries via phone, email, and chat 2. Assist in resolving complaints and providing appropriate solutions 3. Maintain customer records and update databases 4. Support the team in improving customer service processes 5. Gather customer feedback and report insights Requirements: 1. Strong verbal and written communication skills 2. Ability to handle customer interactions with patience and professionalism 3. Problem-solving skills and attention to detail 4. Basic knowledge of MS Office and CRM tools (preferred) 5. Enthusiastic and eager to learn in a fast-paced environment",
    "skills": [
      "CRM",
      "Effective Communication",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732684",
    "jobTitle": "Customer Service/Customer Support",
    "companyName": "AIR HR Solutions",
    "location": "Delhi",
    "duration": "6 Months",
    "stipend": "₹ 8,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/customer-service-customer-support-internship-in-delhi-at-air-hr-solutions1742374436",
    "description": "As a Customer Service/Customer Support intern at AIR HR Solutions, you will have the opportunity to hone your English and Hindi proficiency skills while gaining practical experience in a fast-paced and dynamic work environment. Your role will involve assisting customers with their inquiries, providing solutions to problems, and ensuring a positive customer experience. Your responsibilities will include: 1. Answering customer inquiries via phone, email, and chat in a professional and timely manner. 2. Resolving customer complaints and issues with empathy and understanding. 3. Providing accurate and up-to-date information about products and services. 4. Utilizing MS-Excel and MS-Office to maintain customer records and track interactions. 5. Collaborating with team members to improve processes and customer satisfaction. 6. Demonstrating effective communication and interpersonal skills to build rapport with customers. 7. Going above and beyond to exceed customer expectations and deliver exceptional service. Join our team at AIR HR Solutions and gain valuable hands-on experience in customer service while developing essential skills for your future career success.",
    "skills": [
      "Effective Communication",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Hindi Proficiency (Spoken)",
      "Interpersonal Skills",
      "MS-Excel",
      "MS-Office"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732060",
    "jobTitle": "Social Entrepreneurship (For Graduates)",
    "companyName": "Shraddha Maanu Foundation",
    "location": "Chennai",
    "duration": "6 Months",
    "stipend": "₹ 25,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/one-year-immersive-fellowship-for-graduates-internship-in-chennai-at-shraddha-maanu-foundation1742359605",
    "description": "Are you a recent graduate looking to build a strong foundation for your career in the social sector or any other field of your choice? Look no further! Join us at Shraddha Maanu Foundation for a one-year immersive fellowship where you will gain 21st-century skills through the 4Cs - Critical Thinking, Communication, Collaboration, and Creativity - preparing you for higher studies, career growth, entrepreneurship, or leadership roles. What you will gain: 1. Hands-on work in academics, operations, community engagement, fundraising, and more. 2. Handsome stipend for your contributions. 3. Mentorship from seasoned leaders in the development sector. 4. Fieldwork that will shape you into a changemaker. 5. Practical experience in developing and executing marketing campaigns to promote our foundation's mission and initiatives. 6. Cross-functional collaboration with internal teams across academics, operations, resource mobilization, marketing, and fundraising to gain comprehensive exposure. Don't miss out on this exciting opportunity to make a real impact while growing your skills in a supportive and dynamic environment. Apply now and be part of the change!",
    "skills": [
      "Effective Communication",
      "Marketing Campaigns",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732879",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Urbanroof",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-pune-at-urbanroof1742382164",
    "description": "Selected intern's day-to-day responsibilities include: 1. Respond to all Inbound inquiries and leads coming in via different inbound marketing channels. 2. Attend and address leads in order to qualify them into opportunities. 3. Pass the opportunities to Quota carrying account executives for closures. 4. Tele calls, emails to convert prospects into opportunities. 5. Customer Management (Inbound): Attend to customer concerns, support and pass it to respective CSE to address. 6. Develop selling skills and business knowledge to grow into a client service executive or grow into sales development vertical.",
    "skills": [
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Sales",
      "Certificate",
      "Letter of recommendation",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733036",
    "jobTitle": "Business Development (Sales)",
    "companyName": "GrayQuest Education Finance Private Limited",
    "location": "Jodhpur, Rajasthan",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month +  Incentives",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-grayquest-education-finance-private-limited1742387557",
    "description": "Selected intern's day-to-day responsibilities include: 1. Act as the main point of contact for parents and students in the assigned client location 2. Convince the customers to pay fees through the GQ EMI option and assist in the customer onboarding journey 3. Work with other internal credit and business teams to ensure timely disbursements 4. Develop a thorough understanding of our products and service offerings 5. Build and strengthen client relationships to achieve long-term business relationships",
    "skills": [
      "English Proficiency (Written)",
      "Sales",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732674",
    "jobTitle": "Market Research",
    "companyName": "ReportsInsights Consulting Pvt Ltd",
    "location": "Pune",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/market-research-internship-in-pune-at-reportsinsights-consulting-pvt-ltd1742373959",
    "description": "Key responsibilities: 1. Develop clear, concise, and compelling descriptions for market research reports, summarizing key findings and insights 2. Tailor content to meet the needs of different audiences and align with report objectives 3. Conduct in-depth research across a variety of domains to support content development and ensure accuracy 4. Analyze and synthesize information from various sources, including market research reports, industry publications, and other relevant materials 5. Review and edit content for clarity, coherence, grammar, and adherence to company style and guidelines 6. Ensure all written materials are free from errors and meet the highest quality standards 7. Contribute to the creation of other content types, such as articles, whitepapers, and case studies, as needed 8. Collaborate with analysts and researchers to produce content that supports ongoing projects and client deliverables 9. Maintain consistency in tone, style, and formatting across all written materials. 10. Implement feedback and revisions to improve content quality and accuracy Requirements: 1. Graduates with a major in biotechnology, pharma, food technology, chemical engineering, biology, zoology, microbiology, computer science, electronics, civil, mechanical, or similar fields 2. Post-graduates with an MBA, MCA, M.Tech, or similar qualifications 3. Fluent in English communication and proficient in writing Note: Education should be completed by March 2025 (currently pursuing not applicable).",
    "skills": [
      "Effective Communication",
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "MS-Excel",
      "MS-Office",
      "Research and Analytics",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "Informal dress code",
      "5 days a week",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732941",
    "jobTitle": "Video Editing/Making",
    "companyName": "5 Circles Private Limited",
    "location": "Kanpur",
    "duration": "2 Months",
    "stipend": "₹ 10,000-15,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/video-editing-making-internship-in-kanpur-at-5-circles-private-limited1742386385",
    "description": "Selected intern's day-to-day responsibilities include: 1. Design stunning visuals for digital and print, including ads, social media and brand materials 2. Edit and produce captivating video content for various platforms. 3. Collaborate with the team to align visuals with brand vision and objectives.",
    "skills": [
      "Adobe Illustrator",
      "Adobe Photoshop",
      "Adobe Premiere Pro",
      "Video Editing",
      "Video Making",
      "Certificate",
      "Letter of recommendation"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733057",
    "jobTitle": "Inside Sales",
    "companyName": "Isourse",
    "location": "Delhi",
    "duration": "6 Months",
    "stipend": "₹ 25,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/inside-sales-internship-in-delhi-at-isourse1742388848",
    "description": "Selected intern's day-to-day responsibilities include: 1. Assist in identifying potential customers or clients through market research, cold calling, email campaigns, or other lead-generation activities. 2. Help in identifying new sales opportunities by researching and qualifying leads or prospects. 3. Provide support to the sales team by preparing sales presentations, proposals, and other materials needed for client meetings or pitches. 4. Assist in maintaining and updating customer information in the CRM system, ensuring data accuracy and completeness. 5. Follow up with leads or prospects to schedule meetings, demos, or calls for the sales team. 6. Assist in administrative tasks related to the sales process, such as preparing sales reports, updating sales pipelines, and managing sales documentation. 7. Conduct research on industry trends, competitor analysis, and customer preferences to support sales strategies and decision-making. 8. Develop a deep understanding of the company's products or services to effectively communicate their features, benefits, and value propositions to potential customer.",
    "skills": [
      "English Proficiency (Spoken)",
      "English Proficiency (Written)",
      "Lead Generation",
      "MS-Excel",
      "Negotiation & Problem-solving",
      "Sales",
      "Salesforce",
      "Sales pitch",
      "Certificate",
      "Letter of recommendation",
      "Informal dress code",
      "Free snacks & beverages",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733012",
    "jobTitle": "Operations",
    "companyName": "Creatorshala",
    "location": "Delhi, Dubai (United Arab Emirates), Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 5,000-7,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/operations-internship-in-multiple-locations-at-creatorshala1742387029",
    "description": "Selected intern's day-to-day responsibilities include: 1. Backend e-commerce operations work 2. Audting of orders 3. Social media analytics auditing",
    "skills": [
      "MS-Excel",
      "MS-Office",
      "MS-PowerPoint",
      "MS-Word",
      "Certificate",
      "Letter of recommendation",
      "Flexible work hours",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  }
]